import 'package:flutter/material.dart';

calculate2023RamdanDate() {
  Map<int, int> EngToRamadan = {
    12: 1,
    13: 2,
    14: 3,
    15: 4,
    16: 5,
    17: 6,
    18: 7,
   19: 8,
    20: 9,
    21: 10,
    22: 11,
    23: 12,
    24: 13,
    25: 14,
    26: 15,
    27: 16,
    28: 17,
    29: 18,
    30: 19,
    31: 20,
    1: 21,
    2: 22,
    3: 23,
    4: 24,
    5: 25,
    6: 26,
    7: 27,
    8: 28,
    9: 29,
    10: 30,
  };
  var hour = DateTime.now().hour;
  var date = DateTime.now().day;
  var minute = DateTime.now().minute;
  // var hour = 18;
  // var minute = 49;
  // var date = 17;
  // var ampm = DateTime.now().hour >= 12 ? 'PM' : 'AM';
  if ((hour >= 18)) {
    if (hour == 18 && (minute >= 0 && minute <= 30)) {
      return EngToRamadan[date]!;
    } else {
      return EngToRamadan[date]! + 1;
    }
  } else {
    return EngToRamadan[date]!;
  }
}
int calculate2025RamadanDate() {
  Map<int, int> EngToRamadan = {
    1: 1, // 1st March = 1st Ramadan (starting 6:30 PM)
    2: 2,
    3: 3,
    4: 4,
    5: 5,
    6: 6,
    7: 7,
    8: 8,
    9: 9,
    10: 10,
    11: 11,
    12: 12,
    13: 13,
    14: 14,
    15: 15,
    16: 16,
    17: 17,
    18: 18,
    19: 19,
    20: 20,
    21: 21,
    22: 22,
    23: 23,
    24: 24,
    25: 25,
    26: 26,
    27: 27,
    28: 28,
    29: 29,
    30: 30,
  };

  var now = DateTime.now();
  var hour = now.hour;
  var minute = now.minute;
  var date = now.day;

  if (hour > 18 || (hour == 18 && minute >= 30)) {
    // After 6:30 PM, Ramadan follows today's English date.
    return EngToRamadan[date] ?? 0;
  } else {
    // Before 6:30 PM, Ramadan follows **yesterday’s** English date.
    return EngToRamadan[date - 1] ?? 0;
  }
}

var todays_point = 0;
List<String> koroniyo_list = [
  "আল্লাহ তা'আলার ওপর আস্থা রাখুন ",
  "সালাত সুন্দর করে ধীরস্থিরভাবে আদায় করুন ",
  "কুরআন পড়ুন। যথাসম্ভব বুঝে পড়ার চেষ্টা করুন",
  "যারা কুরআন পড়তে পারেন না, তারা সম্পূর্ণ মনোযোগের সাথে তিলাওয়াত শ্রবণ করুন",
  "প্রত্যেক ভালো কাজ আল্লাহর নামে আরম্ভ করুন",
  "আপনার সম্পদের হিসেব করে যাকাত প্রদান করুন",
  "গোপনে দান করুন",
  "নিকটাত্মীয়দের জন্য ব্যয় করুন",
  "অভাবীদের জন্য ব্যয় করুন",
  "আপনার সিয়ামকে অর্থবহ করার চেষ্টা করুন",
  " চোখের পর্দা করুন",
  "অন্যকে সৎকর্মের দিকে উৎসাহিত এবং পরিচালিত করুন",
  " দিনমজুর ও সাধারণ শ্রেণীর মানুষদের সালাম দিন",
  " অধীনস্থদের প্রতি সদয় থাকুন। তাদের কাজের বোঝা হালকা করে দিন",
  "স্বাস্থ্যসম্মত ইফতার করুন এবং অতিভোজন পরিহার করুন",
  " সাহরীতে একটি হলেও খেজুর খান",
  "ভোর রাতে আল্লাহর নিকট দু'আ করুন"
      "পথে কষ্টদায়ক কিছু দেখলে তা পরিষ্কার করুন",
  " রমাদানে তাহাজ্জুদ আদায়ের অভ্যাস করুন",
  "অর্থহীন ও অহেতুক কাজ পরিহার করুন",
  "টিভি সিরিয়াল, মুভি, নাটক ও সিনেমা দেখা পরিহার করুন"
];

List<String> borjoniyo_list = [
  "কারো ব্যাপারে সন্দেহ বা কুধারণা পোষণ করবেন না",
  "কারো পেছনে সমালোচনা করবেন না",
  "কারো প্রতি রূঢ় আচরণ করবেন না",
  "কারো প্রতি হিংসা বা শত্রুতা লালন করবেন না",
  "কারো কাছ থেকে অবৈধ কোনো সুবিধা নেবেন না বা কাউকে অবৈধ সুবিধা দেবেন না",
  "কারো মনে কষ্ট হয়, এমন কোনো আচরণ করবেন না",
  "সাহরী, ইফতার ও ঈদের কেনাকাটায় অপচয় করবেন না"
];

List<Map<String, dynamic>> Dua_Items = [
  {
    'id': 1,
    'title': 'দ্বীনের উপর অটল থাকার দোয়া',
    'subTitle':
        "يَا مُقَلِّبَ الْقُلُوبِ ثَبِّتْ قَلْبِيْ عَلَى دِيْنِكَ\nহে অন্তরসমূহের পরিবর্তনকারী! আমার অন্তরকে তোমার দ্বীনের উপর অটল রাখো।\nআমি জিজ্ঞাসা করলাম, “হে আল্লাহ্‌র রাসূল (ﷺ) আপনি এ দোয়াটি অধিক পরিমাণে পড়তেন। [তিরমিযীঃ ৩৫২২]",
    'isChecked': false
  },
  {
    'id': 2,
    'title': "জান্নাত লাভ ও জাহান্নাম থেকে আশ্রয় চাওয়া",
    'subTitle':
        "اَللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَأَعُوذُ بِكَ مِنَ النَّارِ\nহে আল্লাহ্‌! আমি তোমার কাছে জান্নাত চাই; আর জাহান্নাম থেকে তোমার কাছে আশ্রয় চাই।[ইবনু মাজাহঃ ৯১০]",
    'isChecked': false
  },
  {
    'id': 3,
    'title': "হিদায়াত বা পথ-নির্দেশনা-১",
    'subTitle':
        "নবী (ﷺ) আলী ইবনু আবী তালিব (রাঃ)-কে আল্লাহ্‌র কাছে (এভাবে) হিদায়াত ও দৃঢ়তা চাওয়ার জন্য নির্দেশ দিয়েছেন -اَللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى وَالسَّدَادَ \nহে আল্লাহ্‌! আমি তোমার কাছে চাই হেদায়েত ও দৃঢ়তা। [মুসলিমঃ ২৭২৫]",
    'isChecked': false
  },
  {
    'id': 4,
    'title': "হিদায়াত বা পথ-নির্দেশনা ২",
    'subTitle':
        "وَاهْدِنِيْ لِأَحْسَنِ الْأَخْلَاقِ لَا يَهْدِيْ لِأَحْسَنِهَا إِلَّا أَنْتَ وَاصْرِفْ عَنِّي سَيِّئَهَا لَا يَصْرِفُ عَنِّي سَيِّئَهَا إِلَّا أَنْتَ\nআমাকে সবচেয়ে সুন্দর শিষ্টাচারের দিশা দাও! তুমি ছাড়া কেউ সুন্দর শিষ্টাচারের দিশা দিতে পারে না। আমার কাছ থেকে মন্দ আচরণ দূর করে দাও! তুমি ছাড়া আর কেউ মন্দ আচরণ দূর করতে পারে না। [মুসলিমঃ ৭৭১]",
    'isChecked': false
  },
  {
    'id': 5,
    'title': "সকল কাজে উত্তম পরিণতি এবং সুরক্ষা",
    'subTitle':
        "اَللَّهُمَّ أَحْسِنْ عَاقِبَتَنَا فِي الْأُمُورِ كُلِّهَا وَأَجِرْنَا مِنْ خِزْيِ الدُّنْيَا وَعَذَابِ الْآَخِرَةِ\nহে আল্লাহ্‌! আমাদের সকল কাজে উত্তম পরিণতি দাও, এবং দুনিয়ার অপমান এবং পরকালের শাস্তি থেকে আমাদের সুরক্ষা দাও।[জামে'উস সগীরঃ ১৪৫০]",
    'isChecked': false
  },
  {
    'id': 6,
    'title': "আল্লাহ্‌র কাছে দুনিয়া-আখিরাতের কল্যান ও প্রশান্তি চাওয়া",
    'subTitle':
        "اَللَّهُمَّ أَصْلِحْ لِي دِينِيَ الَّذِي هُوَ عِصْمَةُ أَمْرِي، وَأَصْلِحْ لِي دُنْيَايَ الَّتِي فِيهَا مَعَاشِي، وَأَصْلِحْ لِي آخِرَتِي الَّتِي فِيهَا مَعَادِي، وَاجْعَلِ الْحَيَاةَ زِيَادَةً لِي فِي كُلِّ خَيْرٍ، وَاجْعَلِ الْمَوْتَ رَاحَةً لِي مِنْ كُلِّ شَرٍّ\nহে আল্লাহ্‌! তুমি আমার দ্বীনকে সুন্দর করো, যা আমার সকল কর্মের হিফাযতকারী। আমার পার্থিব জীবনকে সুন্দর করো, যাতে আমার জীবিকা রয়েছে। আমার পরকালকে সুন্দর করো, যাতে আমার প্রত্যাবর্তন হবে। আমার জন্য হায়াতকে প্রত্যেক কল্যাণে বৃদ্ধি করো এবং মওতকে প্রত্যেক অকল্যাণ থেকে আরামদায়ক করো।[মুসলিমঃ ২৭২০]",
    'isChecked': false
  },
  {
    'id': 7,
    'title': "বরকতময় মাসনূন দোয়া ১",
    'subTitle':
        "اَللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنْ جَهْدِ الْبَلَاءِ وَدَرَكِ الشَّقَاءِ وَسُوْءِ الْقَضَاءِ وَشَمَاتَةِ الْأَعْدَاءِ\n(হে আল্লাহ্‌, আমি আপনার আশ্রয় নিচ্ছি কষ্টদায়ক বিপদ, গভীর দুর্ভাগ্য, খারাপ তাক্বদীর এবং শত্রুদের উপহাস থেকে।) [বুখারীঃ ৬৩৪৭]",
    'isChecked': false
  },
  {
    'id': 8,
    'title': "বরকতময় মাসনূন দোয়া ২",
    'subTitle':
        "اَللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ وَالْجُبْنِ وَالْبُخْلِ وَالْهَرَمِ وَعَذَابِ الْقَبْرِ، اَللَّهُمَّ آتِ نَفْسِيْ تَقْوَاهَا وَزَكِّهَا أَنْتَ خَيْرُ مَنْ زَكَّاهَا أَنْتَ وَلِيُّهَا وَمَوْلَاهَا، اَللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنْ عِلْمٍ لَا يَنْفَعُ وَمِنْ قَلْبٍ لَا يَخْشَعُ وَمِنْ نَفْسٍ لَا تَشْبَعُ وَمِنْ دَعْوَةٍ لَا يُسْتَجَابُ لَهَا.\n(হে আল্লাহ্‌, আমি আপনার আশ্রয় গ্রহণ করছি, অক্ষমতা থেকে, আলসেমি থেকে, কাপুরুষতা থেকে, কৃপণতা থেকে, অতি-বার্ধক্য থেকে এবং কবরের আযাব থেকে। হে আল্লাহ্‌, আমার নফসকে আপনি তাক্বওয়া প্রদান করুন এবং আপন তাযকিয়া-পবিত্রতা দান করুন, নফসকে পবিত্রতা তাযকিয়া প্রদানে আপনিই সর্বোত্তম, আপনিই আমার নফসের অভিভাবক ও বন্ধু। হে আল্লাহ্‌, আমি আপনার আশ্রয় গ্রহণ করছি এমন জ্ঞান থেকে যে জ্ঞান উপকারে লাগে না, এমন হৃদয় (ক্বলব) থেকে যে হৃদয় ভীত হয় না, এমন নফ্‌স থেকে যে নফ্‌স পরিতৃপ্ত হয় না এবং এমন দোয়া থেকে যে দোয়া কবুল হয় না।)[মুসলিমঃ ২৭২২]",
    'isChecked': false
  },
  {
    'id': 9,
    'title': "বরকতময় মাসনূন দোয়া ৩",
    'subTitle':
        "اَللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ، وَتَحَوُّلِ عَافِيَتِكَ، وَفُجَاءَةِ نِقْمَتِكَ وَجَمِيْعِ سَخَطِكَ\n(হে আল্লাহ্‌, আমি আপনার আশ্রয় গ্রহণ করছি, আপনার দেওয়া নেয়ামতের বিলুপ্তি থেকে, আপনার দেওয়া শান্তি-সুস্থতার পরিবর্তন থেকে, আপনার হঠাৎ শাস্তি থেকে এবং আপনার সর্ব প্রকারের অসন্তুষ্টি থেকে।)[মুসলিমঃ ২৭৩৯]",
    'isChecked': false
  },
  {
    'id': 10,
    'title': "বরকতময় মাসনূন দোয়া ৪",
    'subTitle':
        "اَللَّهُمَّ زِدْنَا وَلَا تَنْقُصْنَا وَأَكْرِمْنَا وَلَا تُهِنَّا وَأَعْطِنَا وَلَا تَحْرِمْنَا وَآثِرْنَا وَلَا تُؤْثِرْ عَلَيْنَا وَأَرْضِنَا وَارْضَ عَنَّا \n(হে আল্লাহ্‌, আপনি আমদেরকে বাড়িয়ে দিন, কমাবেন না, আপনি আমাদেরকে সম্মানিত করুন, অপমানিত করবেন না, আমাদেরকে প্রদান করুন, বঞ্চিত করবেন না, আমাদেরকে অগ্রাধিকার প্রদান করুন, আমাদের উপর কাউকে অগ্রাধিকার দিবেন না, আপনি আমাদেরকে সন্তুষ্ট করুন এবং আমাদের উপর আপনি সন্তুষ্ট হোন।)[মুসনাদ আহমাদ ১/১২৪]",
    'isChecked': false
  },
  {
    'id': 11,
    'title': "মহামারী ও রোগব্যাধি",
    'subTitle':
        "اَللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ وَالْجُبْنِ وَالْبُخْلِ وَالْهَرَمِ وَالْقَسْوَةِ وَالْغَفْلَةِ وَالْعَيْلَةِ وَالذِّلَّةِ وَالْمَسْكَنَةِ وَأَعُوْذُ بِكَ مِنَ الْفَقْرِ وَالْكُفْرِ وَالْفُسُوْقِ وَالشِّقَّاقِ وَالنِّفَقِ وَالسُّمْعَةِ والرِّيَاءِ وَأَعُوْذُ بِكَ مِنَ الصَّمَمِ وَالْبَكَمِ وَالْجُنُوْنِ وَالْجُذَامِ وَالْبَرَصِ وَسَيِّءِ الْأَسْقَامِ \n(হে আল্লাহ্‌ আমি আপনার আশ্রয় চাচ্ছি অক্ষমতা, আলস্য, কাপুরুষতা, কৃপণতা, বার্ধক্য-জরাগ্রস্ততা, রূঢ়তা-কঠোরতা, অসতর্কতা, হীনতা-নিঃস্বতা, লাঞ্ছনা ও অসহায়ত্ব থেকে। এবং আমি আপনার আশ্রয় চাচ্ছি দারিদ্র, অবিশ্বাস, পাপাচার, বিচ্ছিন্নতা-অবাধ্যতা, মুনাফিকী, সুনামের লোভ এবং প্রদর্শনেচ্ছা থেকে। এবং আমি আপনার আশ্রয় চাচ্ছি বধিরতা, বাকশক্তিহীনতা, পাগলামি-মানসিক অসুস্থতা, কুষ্ঠ, শ্বেতী এবং সকল খারাপ রোগব্যাধি থেকে।) [সহীহুল জামিঃ ১২৮৫]",
    'isChecked': false
  },
];
List<Map<String, dynamic>> Night_Items = [
  {
    'id': 1,
    'title': 'ইশার আজানের জবাব',
    'subTitle':
        "আবূ হুরায়রাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমরা রসূলুল্লাহ (স)-এর সঙ্গে যাচ্ছিলাম, বিলাল দাঁড়িয়ে আযান দিতে লাগলেন। আযান শেষে বিলাল চুপ করলে রসূলুল্লাহ (স) বললেন, যে ব্যক্তি অন্তরের দৃঢ় প্রত্যয়ের সাথে এর মতো বলবে, সে অবশ্যই জান্নাতে প্রবেশ করবে। [নাসায়ী][ইবনে মাজাহ ৬৭৬]",
    'isChecked': false
  },
  {
    'id': 2,
    'title': "তাহিয়্যাতুল মাসজিদ",
    'subTitle':
        "তোমাদের কেউ মসজিদে প্রবেশ করলে সে যেন বসার পূর্বে দু’রাকাত সলাত  আদায় করে নেয়।[বুখারী ইঃ ফাঃ ৪৩১]\nতোমাদের কেউ মসজিদে প্রবেশ করলে দু’রাকাত সলাত (তাহিয়্যাতুল-মাসজিদ) আদায় করার আগে বসবে না।[বুখারীঃ ইঃফাঃ ১০৯৪]",
    'isChecked': false
  },
  {
    'id': 3,
    'title': "ইশার ৪ রাকা'আত ফরজ",
    'subTitle':
        "প্রতি ৫ ওয়াক্তে ১৭ রাকা'আত ফরজ নামাজের অংশ। বাধ্যতামূলক পড়তেই হবে,না পড়লে গুনাহ হবে।",
    'isChecked': false
  },
  {
    'id': 4,
    'title': "ইশার পর আয়াতুল কুরসি",
    'subTitle':
        "‘যে ব্যক্তি প্রত্যেক ফরজ নামাজের পর আয়াতুল কুরসী পড়বে তার জান্নাতে প্রবেশের মধ্যে কেবল মৃত্যুই একমাত্র বাঁধা।’ [সুনানে নাসায়ী: ৯৯২৮]",
    'isChecked': false
  },
  {
    'id': 5,
    'title':
        'ইশার পর ৩৩ বার সুবহানআল্লহ,৩৩ বার আলহামদুলিল্লাহ এবং ৩৩ বার আল্লহু আকবার',
    'subTitle':
        "যে ব্যক্তি প্রত্যেক ফরয সালাতের পর সুবহানাল্লাহ ৩৩ বার, আলহামদুলিল্লাহ ৩৩ বার, আল্লাহু আকবার ৩৩ বার পাঠ করার পর এই দোয়া (لَا إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لَا شَرِيْكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيْرٌ) ১বার পাঠ করে মোট ১০০ বার পূর্ণ করবে তার সমস্ত গুনাহ(ছগীরা) মাফ হয়ে যাবে; যদিও তা সুমুদ্রের ফেনা পরিমাণ হয়।[সহিহ মুসলিম: ১৩৮০]",
    'isChecked': false
  },
  {
    'id': 6,
    'title':
        "ইশার পর ১০ বার সুবহানআল্লহ, ১০ বার আলহামদুলিল্লাহ এবং ১০ বার আল্লহু আকবার",
    'subTitle':
        "আবূ হুরায়রা (রা) থেকে বর্ণিত:গরীব সাহাবীগণ বললেনঃ হে আল্লাহ্‌র রসূল (স)! ধনী লোকেরা তো উচ্চমর্যাদা ও চিরস্থায়ী নি'য়ামত নিয়ে আমাদের থেকে এগিয়ে গেলেন। তিনি জিজ্ঞেস করলেনঃ তা কেমন করে? তাঁরা বললেনঃ আমরা যে রকম সলাত আদায় করি, তাঁরাও সে রকম সলাত আদায় করেন। আমরা যেমন জিহাদ করি, তাঁরাও তেমন জিহাদ করেন এবং তাঁরাও তাদের অতিরিক্ত মাল দিয়ে সদাকাহ-খয়রাত করেন; কিন্তু আমাদের কাছে সম্পদ নেই। তিনি বললেনঃ আমি কি তোমাদের একটি 'আমাল বাতলে দেব না, যে 'আমাল দ্বারা তোমরা তোমাদের পূর্ববর্তীদের মর্যাদা লাভ করতে পারবে, আর তোমাদের পরবর্তীদের চেয়ে এগিয়ে যেতে পারবে, আর তোমাদের মত 'আমাল কেউ করতে পারবে না, কেবলমাত্র যারা তোমাদের মত 'আমাল করবে তারা ব্যতীত। সে 'আমাল হলো তোমরা প্রত্যেক সালাতের পর ১০ বার 'সুবহানাল্লাহ', ১০ বার 'আলহামদু লিল্লাহ' এবং ১০ বার 'আল্লাহু আকবার' পাঠ করবে।[সহিহ বুখারী- ৬৩২৯]",
    'isChecked': false
  },
  {
    'id': 7,
    'title': "ইশার ২ রাকা'আত সুন্নত ",
    'subTitle':
        "প্রাত্যহিক সুন্নত নামাজের অংশ। বিশেষ ওজর বা রুখসত ছাড়া এই নামাজ ত্যাগ করা উচিত নয়। ",
    'isChecked': false
  },
  {
    'id': 8,
    'title': "তারাবীহ ২০ রাকা'আত",
    'subTitle':
        "যে ব্যক্তি ঈমান অবস্থায় সাওয়াবের আশায় রাতে তারাবীহ ও তাহাজ্জুদ আদায় করবে, আল্লাহ তাঁর পূর্ববতী (সগীরা) গুনাহগুলো মাফ করে দেবেন। [বুখারী :৩৭, মুসলিম :৭৫৯]",
    'isChecked': false
  },
  {
    'id': 9,
    'title': "বিতর ৩ রাকা'আত",
    'subTitle': "বিতর নামাজ পড়া ওয়াজীব। না পড়লে গুনাহ হবে।",
    'isChecked': false
  },
  {
    'id': 10,
    'title': "তাহাজ্জুদ আদায়",
    'subTitle':
        "ফরয সালাতের পর সর্বোত্তম সালাত হল রাতের সালাত (অর্থাৎ তাহাজ্জুদের সালাত)। [মুসলিম : ১১৬৩]\n তোমাদের তাহাজ্জুদের নামাজ আদায় করা উচিত। কেননা তা তোমাদের পূর্বেকার সজ্জন ব্যক্তিদের প্রতীক এবং তোমাদের প্রতিপালকের নৈকট্য লাভের বিশেষ মাধ্যম। নামাজ গোনাহসমূহ বিমোচনকারী এবং গোনাহের প্রতিবন্ধক। [তিরমিজি: ৩৫৪৯, সহিহ ইবনে খুজাইমা: ১০৭৫]",
    'isChecked': false
  },
  {
    'id': 11,
    'title': "সেহরি খাওয়া",
    'subTitle':
        " তোমরা সেহরি খাও, কারণ সেহরিতে বরকত রয়েছে[বুখারি-১৯২৩]\n নবী করীম (স.) আমাদের ও ইহুদী-নাসারাদের রোজার পার্থক্য হলো সেহরি খাওয়া, এক ঢুক পানি দিয়ে হলেও সেহরি গ্রহণ করো।[মুসলিম ২৬০৪]",
    'isChecked': false
  },
  {
    'id': 12,
    'title': "খেজুর দিয়ে সেহরি খাওয়া",
    'subTitle':
        "আবূ হুরাইরাহ (রা.) সূত্রে বর্ণিত। নবী (স) বলেনঃ ঈমানদার ব্যক্তির জন্য খেজুর দিয়ে সাহারী খাওয়া কতোই না উত্তম![সুনান আবূ দাউদ ২৩৪৫]",
    'isChecked': false
  },
];
List<Map<String, dynamic>> Fajr_Items = [
  {
    'id': 1,
    'title': "ফজরের আজানের জবাব",
    'subTitle':
        "আবূ হুরায়রাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমরা রসূলুল্লাহ (স)-এর সঙ্গে যাচ্ছিলাম, বিলাল দাঁড়িয়ে আযান দিতে লাগলেন। আযান শেষে বিলাল চুপ করলে রসূলুল্লাহ (স) বললেন, যে ব্যক্তি অন্তরের দৃঢ় প্রত্যয়ের সাথে এর মতো বলবে, সে অবশ্যই জান্নাতে প্রবেশ করবে। [নাসায়ী][ইবনে মাজাহ ৬৭৬]",
    'isChecked': false
  },
  {
    'id': 2,
    'title': 'তাহিয়্যাতুল মাসজিদ',
    'subTitle':
        "তোমাদের কেউ মসজিদে প্রবেশ করলে সে যেন বসার পূর্বে দু’রাকাত সলাত  আদায় করে নেয়।[বুখারী ইঃ ফাঃ ৪৩১]\nতোমাদের কেউ মসজিদে প্রবেশ করলে দু’রাকাত সলাত (তাহিয়্যাতুল-মাসজিদ) আদায় করার আগে বসবে না।[বুখারীঃ ইঃফাঃ ১০৯৪]",
    'isChecked': false
  },
  {
    'id': 3,
    'title': "ফজরের ২ রাকা'আত সুন্নত",
    'subTitle':
        "“ফজরের দুই রাকআত (সুন্নত) পৃথিবী ও তন্মধ্যস্থিত সকল বস্তু অপেক্ষা উত্তম।”[মুসলিম ৭২৫]",
    'isChecked': false
  },
  {
    'id': 4,
    'title': "ফজরের ২ রাকা'আত ফরজ",
    'subTitle':
        "“যে ব্যক্তি ফজরের নামাজ আদায় করবে সে আল্লাহর জিম্মায় থাকবে।” [মুসলিম:৬৫৭]\n “ফজরের সালাত হলো মুমিন ও মুনাফিকদের মধ্যে পার্থক্যকারী , কারন রসুল (সা) বলেছেন মুনাফিকদের জন্য ফজরের সালাত আদায় করা কষ্টকর!” [সহীহ বুখারী:৬৫৭,৬৪৪,২৪২০,৭২২৪,মুসলিম:৬৬১]\n “যে ব্যক্তি নিয়মিত ফজরের নামাজ আদায় করে সে কখনোই জাহান্নামে প্রবেশ করবে না”[মুসলিম-৬৩৪]",
    'isChecked': false
  },
  {
    'id': 5,
    'title': "ফজরের পর আয়াতুল কুরসি",
    'subTitle':
        "‘যে ব্যক্তি প্রত্যেক ফরজ নামাজের পর আয়াতুল কুরসী পড়বে তার জান্নাতে প্রবেশের মধ্যে কেবল মৃত্যুই একমাত্র বাঁধা।’ [সুনানে নাসায়ী: ৯৯২৮]",
    'isChecked': false
  },
  {
    'id': 6,
    'title':
        "ফজরের পর ৩৩ বার সুবহানআল্লহ,৩৩ বার আলহামদুলিল্লাহ এবং ৩৩ বার আল্লহু আকবার",
    'subTitle':
        "আবূ হুরায়রা (রা) থেকে বর্ণিত:গরীব সাহাবীগণ বললেনঃ হে আল্লাহ্‌র রসূল (স)! ধনী লোকেরা তো উচ্চমর্যাদা ও চিরস্থায়ী নি'য়ামত নিয়ে আমাদের থেকে এগিয়ে গেলেন। তিনি জিজ্ঞেস করলেনঃ তা কেমন করে? তাঁরা বললেনঃ আমরা যে রকম সলাত আদায় করি, তাঁরাও সে রকম সলাত আদায় করেন। আমরা যেমন জিহাদ করি, তাঁরাও তেমন জিহাদ করেন এবং তাঁরাও তাদের অতিরিক্ত মাল দিয়ে সদাকাহ-খয়রাত করেন; কিন্তু আমাদের কাছে সম্পদ নেই। তিনি বললেনঃ আমি কি তোমাদের একটি 'আমাল বাতলে দেব না, যে 'আমাল দ্বারা তোমরা তোমাদের পূর্ববর্তীদের মর্যাদা লাভ করতে পারবে, আর তোমাদের পরবর্তীদের চেয়ে এগিয়ে যেতে পারবে, আর তোমাদের মত 'আমাল কেউ করতে পারবে না, কেবলমাত্র যারা তোমাদের মত 'আমাল করবে তারা ব্যতীত। সে 'আমাল হলো তোমরা প্রত্যেক সালাতের পর ১০ বার 'সুবহানাল্লাহ', ১০ বার 'আলহামদু লিল্লাহ' এবং ১০ বার 'আল্লাহু আকবার' পাঠ করবে।[সহিহ বুখারী- ৬৩২৯]",
    'isChecked': false
  },
  {
    'id': 7,
    'title':
        "ফজরের পর ১০ বার সুবহানআল্লহ, ১০ বার আলহামদুলিল্লাহ এবং ১০ বার আল্লহু আকবার",
    'subTitle':
        "যে ব্যক্তি প্রত্যেক ফরয সালাতের পর সুবহানাল্লাহ ৩৩ বার, আলহামদুলিল্লাহ ৩৩ বার, আল্লাহু আকবার ৩৩ বার পাঠ করার পর এই দোয়া (لَا إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لَا شَرِيْكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيْرٌ) ১বার পাঠ করে মোট ১০০ বার পূর্ণ করবে তার সমস্ত গুনাহ(ছগীরা) মাফ হয়ে যাবে; যদিও তা সুমুদ্রের ফেনা পরিমাণ হয়।[সহিহ মুসলিম: ১৩৮০]",
    'isChecked': false
  },
  {
    'id': 8,
    'title': "সূরা ইখলাস, সূরা ফালাক ও সূরা নাস ১ বার",
    'subTitle':
        "উকবা ইবনু আমির (রাঃ) বলেন, রাসূলুল্লাহ (স.) আমাকে নির্দেশ দিয়েছেন, প্রত্যেক সালাতের পরে সূরা ফালাক ও সূরা নাস পাঠ করতে। দ্বিতীয় বর্ণনায় তিনি বলেন, রাসূলুল্লাহ (স.) আমাকে প্রত্যেক সালাতের পরে মুআওয়িযাত, (সূরা ইখলাস, সূরা ফালাক ও সূরা নাস) পাঠ করতে নির্দেশ দিয়েছেন[সুনানু আবী দাউদ ১৫২৩, সুনানুত তিরমিযী ২৯০৩]",
    'isChecked': false
  },
  {
    'id': 9,
    'title': "একশত বার ‘সুবহানাল্লহি ওয়া বি হামদিহী’ পাঠ করা",
    'subTitle':
        "আবু হুরাইরাহ (রদ্বি) থেকে বর্ণিত, নবী (স) বলেছেনঃ যে ব্যক্তি সকালে ও বিকালে একশত বার বলেঃ সুবাহানাল্লহি ওয়া বিহামদিহী”, কিয়ামতের দিন তার চাইলে উত্তম (আমালকারী) আর কেউ হবে না। তবে যে লোক তার ন্যায় কিংবা তার চাইতে অধিক পরিমান তা বলে (সে উত্তম ‘আমালকারী বলে গণ্য হবে)।”[তাহ’লীকুর রাগিব (হাঃ ১/২২৬), মুসলিম। জামে’ আত তিরমিজি ৩৪৬৯]",
    'isChecked': false
  },
];
List<Map<String, dynamic>> Dhuhr_Items = [
  {
    'id': 1,
    'title': "যোহরের আজানের জবাব",
    'subTitle':
        "আবূ হুরায়রাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমরা রসূলুল্লাহ (স)-এর সঙ্গে যাচ্ছিলাম, বিলাল দাঁড়িয়ে আযান দিতে লাগলেন। আযান শেষে বিলাল চুপ করলে রসূলুল্লাহ (স) বললেন, যে ব্যক্তি অন্তরের দৃঢ় প্রত্যয়ের সাথে এর মতো বলবে, সে অবশ্যই জান্নাতে প্রবেশ করবে। [নাসায়ী][ইবনে মাজাহ ৬৭৬]",
    'isChecked': false
  },
  {
    'id': 2,
    'title': "তাহিয়াতুল মাসজিদ ২ রাকা'আত নফল",
    'subTitle':
        "তোমাদের কেউ মসজিদে প্রবেশ করলে সে যেন বসার পূর্বে দু’রাকাত সলাত  আদায় করে নেয়।[বুখারী ইঃ ফাঃ ৪৩১]\nতোমাদের কেউ মসজিদে প্রবেশ করলে দু’রাকাত সলাত (তাহিয়্যাতুল-মাসজিদ) আদায় করার আগে বসবে না।[বুখারীঃ ইঃফাঃ ১০৯৪]",
    'isChecked': false
  },
  {
    'id': 3,
    'title': "যোহরের ৪ রাকা'আত সুন্নত",
    'subTitle':
        "প্রাত্যহিক সুন্নত নামাজের অংশ। বিশেষ ওজর বা রুখসত ছাড়া এই নামাজ ত্যাগ করা উচিত নয়। ",
    'isChecked': false
  },
  {
    'id': 4,
    'title': "যোহরের ৪ রাকা'আত ফরজ",
    'subTitle':
        "প্রতি ৫ ওয়াক্তে ১৭ রাকা'আত ফরজ নামাজের অংশ। বাধ্যতামূলক পড়তেই হবে,না পড়লে গুনাহ হবে।",
    'isChecked': false
  },
  {
    'id': 5,
    'title': "যোহরের পর আয়াতুল কুরসি",
    'subTitle':
        "‘যে ব্যক্তি প্রত্যেক ফরজ নামাজের পর আয়াতুল কুরসী পড়বে তার জান্নাতে প্রবেশের মধ্যে কেবল মৃত্যুই একমাত্র বাঁধা।’ [সুনানে নাসায়ী: ৯৯২৮]",
    'isChecked': false
  },
  {
    'id': 6,
    'title':
        "যোহরের পর ৩৩ বার সুবহানআল্লহ,৩৩ বার আলহামদুলিল্লাহ এবং ৩৩ বার আল্লহু আকবার",
    'subTitle':
        "আবূ হুরায়রা (রা) থেকে বর্ণিত:গরীব সাহাবীগণ বললেনঃ হে আল্লাহ্‌র রসূল (স)! ধনী লোকেরা তো উচ্চমর্যাদা ও চিরস্থায়ী নি'য়ামত নিয়ে আমাদের থেকে এগিয়ে গেলেন। তিনি জিজ্ঞেস করলেনঃ তা কেমন করে? তাঁরা বললেনঃ আমরা যে রকম সলাত আদায় করি, তাঁরাও সে রকম সলাত আদায় করেন। আমরা যেমন জিহাদ করি, তাঁরাও তেমন জিহাদ করেন এবং তাঁরাও তাদের অতিরিক্ত মাল দিয়ে সদাকাহ-খয়রাত করেন; কিন্তু আমাদের কাছে সম্পদ নেই। তিনি বললেনঃ আমি কি তোমাদের একটি 'আমাল বাতলে দেব না, যে 'আমাল দ্বারা তোমরা তোমাদের পূর্ববর্তীদের মর্যাদা লাভ করতে পারবে, আর তোমাদের পরবর্তীদের চেয়ে এগিয়ে যেতে পারবে, আর তোমাদের মত 'আমাল কেউ করতে পারবে না, কেবলমাত্র যারা তোমাদের মত 'আমাল করবে তারা ব্যতীত। সে 'আমাল হলো তোমরা প্রত্যেক সালাতের পর ১০ বার 'সুবহানাল্লাহ', ১০ বার 'আলহামদু লিল্লাহ' এবং ১০ বার 'আল্লাহু আকবার' পাঠ করবে।[সহিহ বুখারী- ৬৩২৯]",
    'isChecked': false
  },
  {
    'id': 7,
    'title':
        "যোহরের পর ১০ বার সুবহানআল্লহ, ১০ বার আলহামদুলিল্লাহ এবং ১০ বার আল্লহু আকবার",
    'subTitle':
        "যে ব্যক্তি প্রত্যেক ফরয সালাতের পর সুবহানাল্লাহ ৩৩ বার, আলহামদুলিল্লাহ ৩৩ বার, আল্লাহু আকবার ৩৩ বার পাঠ করার পর এই দোয়া (لَا إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لَا شَرِيْكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيْرٌ) ১বার পাঠ করে মোট ১০০ বার পূর্ণ করবে তার সমস্ত গুনাহ(ছগীরা) মাফ হয়ে যাবে; যদিও তা সুমুদ্রের ফেনা পরিমাণ হয়।[সহিহ মুসলিম: ১৩৮০]",
    'isChecked': false
  },
  {
    'id': 8,
    'title': "যোহরের ২ রাকা'আত সুন্নত",
    'subTitle':
        "প্রাত্যহিক সুন্নত নামাজের অংশ। বিশেষ ওজর বা রুখসত ছাড়া এই নামাজ ত্যাগ করা উচিত নয়। ",
    'isChecked': false
  },
  {
    'id': 9,
    'title': "যোহরের পর ২ রাকা'আত নফল",
    'subTitle':
        "যোহরে সর্বমোট ১২ রাকা'আত পড়ার বিশেষ ফজিলত আছে।\n“যে ব্যক্তি যোহরের পূর্বে ৪ রাকা'আত এবং পরে ৪ রাকা'আত (সুন্নত নামাযের) প্রতি সবিশেষ যত্নবান হবে, আল্লাহ তাকে জাহান্নামের জন্য হারাম করে দেবেন।” [মিশকাত ১১৬৭, সহিহ তারগিব ৫৮১]",
    'isChecked': false
  },
];

List<Map<String, dynamic>> Good_Afternoon_Items = [
  {
    'id': 1,
    'title': "আসরের আজানের জবাব দেওয়া",
    'subTitle':
        "আবূ হুরায়রাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমরা রসূলুল্লাহ (স)-এর সঙ্গে যাচ্ছিলাম, বিলাল দাঁড়িয়ে আযান দিতে লাগলেন। আযান শেষে বিলাল চুপ করলে রসূলুল্লাহ (স) বললেন, যে ব্যক্তি অন্তরের দৃঢ় প্রত্যয়ের সাথে এর মতো বলবে, সে অবশ্যই জান্নাতে প্রবেশ করবে। [নাসায়ী][ইবনে মাজাহ ৬৭৬]",
    'isChecked': false
  },
  {
    'id': 2,
    'title': "তাহিয়্যাতুল মাসজিদ ২ রাকা'আত নফল",
    'subTitle':
        "তোমাদের কেউ মসজিদে প্রবেশ করলে সে যেন বসার পূর্বে দু’রাকাত সলাত  আদায় করে নেয়।[বুখারী ইঃ ফাঃ ৪৩১]\nতোমাদের কেউ মসজিদে প্রবেশ করলে দু’রাকাত সলাত (তাহিয়্যাতুল-মাসজিদ) আদায় করার আগে বসবে না।[বুখারীঃ ইঃফাঃ ১০৯৪]",
    'isChecked': false
  },
  {
    'id': 3,
    'title': "আসরের ৪ রাকা'আত ফরজ",
    'subTitle':
        "প্রতি ৫ ওয়াক্তে ১৭ রাকা'আত ফরজ নামাজের অংশ। বাধ্যতামূলক পড়তেই হবে,না পড়লে গুনাহ হবে।",
    'isChecked': false
  },
  {
    'id': 4,
    'title': "আসরের পর আয়াতুল কুরসি",
    'subTitle':
        "‘যে ব্যক্তি প্রত্যেক ফরজ নামাজের পর আয়াতুল কুরসী পড়বে তার জান্নাতে প্রবেশের মধ্যে কেবল মৃত্যুই একমাত্র বাঁধা।’ [সুনানে নাসায়ী: ৯৯২৮]",
    'isChecked': false
  },
  {
    'id': 5,
    'title':
        "আসরের পর ৩৩ বার সুবহানআল্লহ,৩৩ বার আলহামদুলিল্লাহ এবং ৩৩ বার আল্লহু আকবার",
    'subTitle':
        "আবূ হুরায়রা (রা) থেকে বর্ণিত:গরীব সাহাবীগণ বললেনঃ হে আল্লাহ্‌র রসূল (স)! ধনী লোকেরা তো উচ্চমর্যাদা ও চিরস্থায়ী নি'য়ামত নিয়ে আমাদের থেকে এগিয়ে গেলেন। তিনি জিজ্ঞেস করলেনঃ তা কেমন করে? তাঁরা বললেনঃ আমরা যে রকম সলাত আদায় করি, তাঁরাও সে রকম সলাত আদায় করেন। আমরা যেমন জিহাদ করি, তাঁরাও তেমন জিহাদ করেন এবং তাঁরাও তাদের অতিরিক্ত মাল দিয়ে সদাকাহ-খয়রাত করেন; কিন্তু আমাদের কাছে সম্পদ নেই। তিনি বললেনঃ আমি কি তোমাদের একটি 'আমাল বাতলে দেব না, যে 'আমাল দ্বারা তোমরা তোমাদের পূর্ববর্তীদের মর্যাদা লাভ করতে পারবে, আর তোমাদের পরবর্তীদের চেয়ে এগিয়ে যেতে পারবে, আর তোমাদের মত 'আমাল কেউ করতে পারবে না, কেবলমাত্র যারা তোমাদের মত 'আমাল করবে তারা ব্যতীত। সে 'আমাল হলো তোমরা প্রত্যেক সালাতের পর ১০ বার 'সুবহানাল্লাহ', ১০ বার 'আলহামদু লিল্লাহ' এবং ১০ বার 'আল্লাহু আকবার' পাঠ করবে।[সহিহ বুখারী- ৬৩২৯]",
    'isChecked': false
  },
  {
    'id': 6,
    'title':
        "আসরের পর ১০ বার সুবহানআল্লহ, ১০ বার আলহামদুলিল্লাহ এবং ১০ বার আল্লহু আকবার",
    'subTitle':
        "যে ব্যক্তি প্রত্যেক ফরয সালাতের পর সুবহানাল্লাহ ৩৩ বার, আলহামদুলিল্লাহ ৩৩ বার, আল্লাহু আকবার ৩৩ বার পাঠ করার পর এই দোয়া (لَا إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لَا شَرِيْكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيْرٌ) ১বার পাঠ করে মোট ১০০ বার পূর্ণ করবে তার সমস্ত গুনাহ(ছগীরা) মাফ হয়ে যাবে; যদিও তা সুমুদ্রের ফেনা পরিমাণ হয়।[সহিহ মুসলিম: ১৩৮০]",
    'isChecked': false
  },
];

TextEditingController quran_ayat_hifz_controller = new TextEditingController();
TextEditingController natun_maswala_sikha_controller =
    new TextEditingController();
TextEditingController islamic_natun_kisu_sikha_controller =
    new TextEditingController();
TextEditingController quran_tilwat_kora_controller =
    new TextEditingController();
TextEditingController quran_tafsir_pora_controller =
    new TextEditingController();
TextEditingController dua_mukhusto_kora_controller =
    new TextEditingController();
List<Map<String, dynamic>> Good_Afternoon_Items_inputs = [
  {
    'id': 1,
    'title': "ক্বুর'আনের আয়াত হিফজ",
    'Value': "২০ আয়াত বা সুরা মুলক ১-২০",
    'controller': quran_ayat_hifz_controller,
    'isChecked': false
  },
  {
    'id': 2,
    'title': "নতুন মাস'আলা শেখা",
    'Value': "২ টা মাস'আলা",
    'controller': natun_maswala_sikha_controller,
    'isChecked': false
  },
  {
    'id': 3,
    'title': "ইসলামিক নতুন কিছু শেখা",
    'Value': "২টা হাদিস + ২ টা ইসলামিক আদব/মাস'আলা",
    'controller': islamic_natun_kisu_sikha_controller,
    'isChecked': false
  },
  {
    'id': 4,
    'title': "ক্বুর'আন তিলাওয়াত করা",
    'Value': "৫০ মিনিট বা ১০০ আয়াত",
    'controller': quran_tilwat_kora_controller,
    'isChecked': false
  },
  {
    'id': 5,
    'title': "ক্বুর'আনের তাফসীর অধ্যয়ন",
    'Value': "৩০ মিনিট",
    'controller': quran_tafsir_pora_controller,
    'isChecked': false
  },
  {
    'id': 6,
    'title': "দু'আ মুখস্ত করা",
    'controller': dua_mukhusto_kora_controller,
    'Value': "৩০ মিনিট অথবা ২ টা দু'আ",
    'isChecked': false
  },
];

List<Map<String, dynamic>> Evening_Items = [
  {
    'id': 1,
    'title': "ইফতার + আজানের জবাব",
    'subTitle':
        "আবূ হুরায়রাহ্ (রাঃ) হতে বর্ণিত। তিনি বলেন, আমরা রসূলুল্লাহ (স)-এর সঙ্গে যাচ্ছিলাম, বিলাল দাঁড়িয়ে আযান দিতে লাগলেন। আযান শেষে বিলাল চুপ করলে রসূলুল্লাহ (স) বললেন, যে ব্যক্তি অন্তরের দৃঢ় প্রত্যয়ের সাথে এর মতো বলবে, সে অবশ্যই জান্নাতে প্রবেশ করবে। [নাসায়ী][ইবনে মাজাহ ৬৭৬]",
    'isChecked': false
  },
  {
    'id': 2,
    'title': "মাগরিবের ৩ রাকা'আত ফরজ",
    'subTitle':
        "প্রতি ৫ ওয়াক্তে ১৭ রাকা'আত ফরজ নামাজের অংশ। বাধ্যতামূলক পড়তেই হবে,না পড়লে গুনাহ হবে।",
    'isChecked': false
  },
  {
    'id': 3,
    'title': "মাগরিবের পর আয়াতুল কুরসি",
    'subTitle':
        "‘যে ব্যক্তি প্রত্যেক ফরজ নামাজের পর আয়াতুল কুরসী পড়বে তার জান্নাতে প্রবেশের মধ্যে কেবল মৃত্যুই একমাত্র বাঁধা।’ [সুনানে নাসায়ী: ৯৯২৮]",
    'isChecked': false
  },
  {
    'id': 4,
    'title':
        "মাগরিবের পর ৩৩ বার সুবহানআল্লহ,৩৩ বার আলহামদুলিল্লাহ এবং ৩৩ বার আল্লহু আকবার",
    'subTitle':
        "আবূ হুরায়রা (রা) থেকে বর্ণিত:গরীব সাহাবীগণ বললেনঃ হে আল্লাহ্‌র রসূল (স)! ধনী লোকেরা তো উচ্চমর্যাদা ও চিরস্থায়ী নি'য়ামত নিয়ে আমাদের থেকে এগিয়ে গেলেন। তিনি জিজ্ঞেস করলেনঃ তা কেমন করে? তাঁরা বললেনঃ আমরা যে রকম সলাত আদায় করি, তাঁরাও সে রকম সলাত আদায় করেন। আমরা যেমন জিহাদ করি, তাঁরাও তেমন জিহাদ করেন এবং তাঁরাও তাদের অতিরিক্ত মাল দিয়ে সদাকাহ-খয়রাত করেন; কিন্তু আমাদের কাছে সম্পদ নেই। তিনি বললেনঃ আমি কি তোমাদের একটি 'আমাল বাতলে দেব না, যে 'আমাল দ্বারা তোমরা তোমাদের পূর্ববর্তীদের মর্যাদা লাভ করতে পারবে, আর তোমাদের পরবর্তীদের চেয়ে এগিয়ে যেতে পারবে, আর তোমাদের মত 'আমাল কেউ করতে পারবে না, কেবলমাত্র যারা তোমাদের মত 'আমাল করবে তারা ব্যতীত। সে 'আমাল হলো তোমরা প্রত্যেক সালাতের পর ১০ বার 'সুবহানাল্লাহ', ১০ বার 'আলহামদু লিল্লাহ' এবং ১০ বার 'আল্লাহু আকবার' পাঠ করবে।[সহিহ বুখারী- ৬৩২৯]",
    'isChecked': false
  },
  {
    'id': 5,
    'title':
        "মাগরিবের পর ১০ বার সুবহানআল্লহ, ১০ বার আলহামদুলিল্লাহ এবং ১০ বার আল্লহু আকবার",
    'subTitle':
        "যে ব্যক্তি প্রত্যেক ফরয সালাতের পর সুবহানাল্লাহ ৩৩ বার, আলহামদুলিল্লাহ ৩৩ বার, আল্লাহু আকবার ৩৩ বার পাঠ করার পর এই দোয়া (لَا إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لَا شَرِيْكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيْرٌ) ১বার পাঠ করে মোট ১০০ বার পূর্ণ করবে তার সমস্ত গুনাহ(ছগীরা) মাফ হয়ে যাবে; যদিও তা সুমুদ্রের ফেনা পরিমাণ হয়।[সহিহ মুসলিম: ১৩৮০]",
    'isChecked': false
  },
  {
    'id': 6,
    'title': "মাগরিবের ২ রাকা'আত সুন্নত",
    'subTitle':
        "প্রাত্যহিক সুন্নত নামাজের অংশ। বিশেষ ওজর বা রুখসত ছাড়া এই নামাজ ত্যাগ করা উচিত নয়। ",
    'isChecked': false
  },
];

List<Map<String, dynamic>> General_Items = [
  {
    'id': 1,
    'title': "নন মাহরামের সাথে কথা না বলা",
    'subTitle': "",
    'isChecked': false
  },
  {
    'id': 2,
    'title': "নন মাহরাম থেকে দৃষ্টি হিফাজত করা",
    'subTitle': "",
    'isChecked': false
  },
  {
    'id': 3,
    'title': "অপ্রয়োজনীয় কথা/কাজ পরিহার করা",
    'subTitle': "",
    'isChecked': false
  },
  {
    'id': 4,
    'title': "কমপক্ষে ১০০ বার ইস্তিগফার করা",
    'subTitle': " ",
    'isChecked': false
  },
  {
    'id': 5,
    'title': "মজা করেও মিথ্যা কথা না বলা",
    'subTitle': "",
    'isChecked': false
  },
  {
    'id': 6,
    'title': "স্বলাত খুশুখুজুর সাথে আদায় করা",
    'subTitle': "",
    'isChecked': false
  },
  {
    'id': 7,
    'title': "কমপক্ষে ৫ টাকা দান/স্বদাক্বা করা",
    'subTitle': "",
    'isChecked': false
  },
  {
    'id': 8,
    'title': "অশ্লীলতা পরিহার করা,  অশ্লীল বাক্য উচ্চারণ না করা",
    'subTitle': "",
    'isChecked': false
  },
  {'id': 9, 'title': "গীবত থেকে বিরত থাকা", 'subTitle': "", 'isChecked': false},
  {
    'id': 10,
    'title': "সূরা ইখলাস ১০ বার",
    'subTitle':
        "“যে ব্যক্তি ১০ বার সূরা ইখলাস পাঠ করবে, আল্লাহ তাঁর জন্য জান্নাতে একটি বাড়ি বানিয়ে রাখবেন।”[সহীহুল জামিয়িস সাগীর ৬৪৭২]",
    'isChecked': false
  },
];

List<String> Asmaul_Husna = [
  "ٱلْرَّحْمَـانُ  পরম দয়ালু",
  "ٱلْرَّحِيْمُ  অতিশয় মেহেরবান",
  "ٱلْمَلِكُ  সর্বকর্তৃত্বময়",
  "ٱلْقُدُّوسُ  অতি পবিত্র",
  "ٱلْسَّلَامُ  শান্তি দানকারী",
  "ٱلْمُؤْمِنُ  নিরাপত্তা ও ঈমান দানকারী",
  "ٱلْمُهَيْمِنُ  পরিপূর্ণ রক্ষণাবেক্ষণকারী",
  "ٱلْعَزِيزُ  পরাক্রমশালী",
  " ٱلْجَبَّارُ দুর্নিবার",
  "ٱلْمُتَكَبِّرُ  নিরঙ্কুশ শ্রেষ্ঠত্বের অধিকারী",
  "  ٱلْخَالِقُ  সৃষ্টিকর্তা",
  "ٱلْبَارِئُ  সঠিকভাবে সৃষ্টিকারী",
  "  ٱلْمُصَوِّرُ আকৃতি দানকারী",
  "ٱلْغَفَّارُ  পরম ক্ষমাশীল",
  " ٱلْقَهَّارُ  কঠোর",
  "لْوَهَّابُ  সবকিছু দানকারী",
  "  لْرَّزَّاقُ  রিযিকদাতা",
  "ٱلْفَتَّاحُ  বিজয়দানকারী",
  "ٱلْعَلِيمُ  সর্বজ্ঞ",
  "ٱلْقَابِضُ  সংকীর্ণকারী",
  "ٱلْبَاسِطُ  প্রশস্তকারী",
  "ٱلْخَافِضُ  অবনতকারী",
  "ٱلْرَّافِعُ  উন্নতকারী",
  "ٱلْمُعِزُّ  সম্মান দানকারী",
  "(অবিশ্বাসীদের) বেইজ্জতকারী ٱلْمُذِلُّ",
  "ٱلْسَّمِيعُ  সর্বশ্রোতা",
  "ٱلْبَصِيرُ  সর্ববিষয় দর্শনকারী",
  "  ٱلْحَكَمُ  অতল বিচারক",
  "ٱلْعَدْلُ  পরিপূর্ণ ন্যায়বিচারক",
  "  ٱلْلَّطِيفُ  সকল গোপন বিষয়ে অবগত",
  "ٱلْخَبِيرُ  সকল বিষয়ে জ্ঞাত",
  "ٱلْحَلِيمُ  অত্যন্ত ধর্য্যশীল",
  "ٱلْعَظِيمُ  সর্বত্ত মর্যাদাশীল",
  "  ٱلْغَفُورُ  পরম ক্ষমাশীল",
  "ٱلْشَّكُورُ  গুন্গ্রাহী",
  "ٱلْعَلِيُّ  উচ্চ মর্যাদাশীল",
  "ٱلْكَبِيرُ  সুমহান",
  "ٱلْحَفِيظُ  সংরক্ষণকারী",
  "ٱلْمُقِيتُ  সকলের জীবনোপকরণ দানকারী",
  "ٱلْحَسِيبُ  হিসাব গ্রহণকারী",
  "ٱلْجَلِيلُ আল জলীল- পরম মর্যাদার অধিকারী",
  "ٱلْكَرِيمُ  সুমহান দাতা",
  "ٱلْرَّقِيبُ  তত্ত্বাবধায়ক",
  "ٱلْمُجِيبُ  কবুলকারী",
  "ٱلْوَاسِعُ  সর্বত্ত বিরাজমান",
  "ٱلْحَكِيمُ  পরম প্রজ্ঞাময়",
  "ٱلْوَدُودُ  (বান্দাদের প্রতি) সদয়",
  "ٱلْمَجِيدُ  সকল মর্যাদার অধিকারী",
  "ٱلْبَاعِثُ  পুনরুজ্জীবিতকারী",
  "ٱلْشَّهِيدُ  সর্বজ্ঞ স্বাক্ষী",
  "ٱلْحَقُّ  পরম সত্য",
  "ٱلْوَكِيلُ  পরম নির্ভরযোগ্য কর্ম-সম্পাদনকারী",
  "ٱلْقَوِيُّ  পরম শক্তির অধিকারী",
  "ٱلْمَتِينُ  সুদৃঢ়",
  "ٱلْوَلِيُّ  অভিভাবক ও সাহায্যকারী",
  "ٱلْحَمِيدُ  সকল প্রশংসার অধিকারী",
  "ٱلْمُحْصِيُ  সকল সৃষ্টির ব্যাপারে অবগত",
  "ٱلْمُبْدِئُ  প্রথমবার সৃষ্টিকর্তা",
  "ٱلْمُعِيدُ  পুনরায় সৃষ্টিকর্তা",
  "ٱلْمُحْيِى  জীবন দানকারী",
  "ٱلْمُمِيتُ  মৃত্যু দানকারী",
  "ٱلْحَىُّ  চিরঞ্জীব",
  "ٱلْقَيُّومُ  সমস্ত কিছুর ধারক ও সংরক্ষণকারী",
  "ٱلْوَاجِدُ  অফুরন্ত ভান্ডারের অধিকারী",
  "ٱلْمَاجِدُ  শ্রেষ্ঠত্বের অধিকারী",
  "ٱلْوَاحِدُ  এক ও অদ্বিতীয়",
  "ٱلْأَحَد  এক",
  "ٱلْصَّمَدُ  অমুখাপেক্ষি",
  "ٱلْقَادِرُ  সর্বশক্তিমান",
  "ٱلْمُقْتَدِرُ  নিরঙ্কুশ সিদ্ধান্তের অধিকারী",
  "ٱلْمُقَدِّمُ  অগ্রসারক",
  "ٱلْمُؤَخِّرُ  অবকাশ দানকারী",
  "ٱلأَوَّلُ  অনাদি",
  "ٱلْآخِرُ  অনন্ত, সর্বশেষ",
  "ٱلْظَّاهِرُ  সম্পূর্ণরূপে প্রকাশিত",
  "ٱلْبَاطِن  দৃষ্টি হতে অদৃশ্য",
  "ٱلْوَالِي  সমস্ত কিছুর অভিভাবক",
  "ٱلْمُتَعَالِي  সৃষ্টির গুণাবলীর উর্দ্ধে",
  "ٱلْبَرُّ  পরম উপকারী",
  "ٱلْتَّوَّابُ  তাওবার তৌফিক দানকারী ও কবুলকারী",
  "ٱلْمُنْتَقِمُ  প্রতিশোধ গ্রহণকারী",
  "ٱلْعَفُوُّ  পরম উদার",
  "ٱلْرَّؤُفُ  পরম স্নেহশীল",
  "مَالِكُ ٱلْمُلْكُ  সমগ্র জগতের বাদশাহ",
  "ذُو ٱلْجَلَالِ وَٱلْإِكْرَامُ যুল জালালী  মহিমান্বিত ও দয়াবান সত্তা",
  "ٱلْمُقْسِطُ  হকদারের হোক আদায়কারী",
  "ٱلْجَامِعُ  একত্রকারী, সমবেতকারী",
  "ٱلْغَنيُّ  অমুখাপেক্ষি ধনী",
  "ٱلْمُغْنِيُّ  পরম অভাবমোচনকারী",
  "ٱلْمَانِعُ  অকল্যাণরোধক",
  "ٱلْضَّارُ  ক্ষতিসাধনকারী",
  "ٱلْنَّافِعُ  কল্যাণকারী",
  "ٱلْنُّورُ  পরম আলো",
  "ٱلْهَادِي  পথ প্রদর্শক",
  "ٱلْبَدِيعُ  অতুলনীয়",
  "ٱلْبَاقِي  চিরস্থায়ী, অবিনশ্বর",
  "لْوَارِثُ  উত্তরাধিকারী",
  "ٱلْرَّشِيدُ  সঠিক পথ প্রদর্শক",
  "ٱلْصَّبُورُ  অত্যাধিক ধর্য্য ধারণকারী"
];
// CalculateTodaysPoints() async {
//   int _points = 0;
//   var good_afternoon_point =
//       await Good_Afternoon_Items.where((e) => e['isChecked'] == true).length;
//   var night_point =
//       await Night_Items.where((e) => e['isChecked'] == true).length;
//   var fajr_point = await Fajr_Items.where((e) => e['isChecked'] == true).length;
//   var dhuhr_point =
//       await Dhuhr_Items.where((e) => e['isChecked'] == true).length;
//   var general_point =
//       await General_Items.where((e) => e['isChecked'] == true).length;

//   _points = await good_afternoon_point +
//       night_point +
//       fajr_point +
//       dhuhr_point +
//       general_point;
//   return await _points;
// }

List<String> AjkerAyat = [
  "  “হে ঈমানদারগণ! তোমাদের ওপর সাওম ফরয করা হয়েছে। যেরূপ ফরয করা হয়েছিল তোমাদের পূর্ববর্তী লোকদের ওপর। যেন তোমরা তাকওয়া অর্জন করতে পার।” [সূরা আল-বাকারা, আয়াত: ১৮৩]",
  "“যে সংশোধিত হলো, সেই সফলকাম হলো”। [সূরা আল-আ‘লা, আয়াত: ১৪]",
  "إِنَّمَا يُوَفَّى الصَّابِرُونَ أَجْرَهُمْ بِغَيْرِ حِسَابٍ \nধৈর্য্যধারণকারীগণই অগণিত সওয়াবের অধিকারী হবে।-সূরা যুমার: ১০",
  "আর তিনি দিবা রাত্রিকে পরস্পরের অনুগামী করেছেন। যে উপদেশ গ্রহণ করতে চায় অথবা কৃতজ্ঞ হতে চায় তার জন্য। (সূরা আল ফুরকান, ৬২ আয়াত)।",
  "اِنَّ اللهَ مَعَ الَّذِیْنَ اتَّقَوْا وَّ الَّذِیْنَ هُمْ مُّحْسِنُوْنَ. \nনিশ্চয়ই আল্লাহ তাঁদের সাথে থাকেন, যারা তাকওয়া অবলম্বন করে। -সূরা নাহল : ১২৮",
  "وَ مَنْ یَّتَّقِ اللهَ یُكَفِّرْ عَنْهُ سَیِّاٰتِهٖ وَ یُعْظِمْ لَهٗۤ اَجْرًا. \nযে তাকওয়া অবলম্বন করে আল্লাহ তার গুনাহসমূহ মাফ করে দেন এবং তাকে বিরাট আজর দান করেন। -সূরা ত্বলাক (৬৫) : ৫",
  "وَاتَّقُوا اللهَ إِنَّ اللهَ غَفُورٌ رَحِيمٌ. \nতোমরা আল্লাহকে ভয় করো। নিশ্চয়ই আল্লাহ ক্ষমাশীল দয়ালু। -সূরা আনফাল : ৬৯",
  "وَ مَنْ یَّتَّقِ اللهَ یَجْعَلْ لَّهٗ مِنْ اَمْرِهٖ یُسْرًا.\nযে তাক্বওয়া অবলম্বন করে আল্লাহ তার সব বিষয় সহজ করে দেন। -সূরা ত্বলাক (৬৫) : ৪",
  "اِنَّ لِلْمُتَّقِیْنَ مَفَازًا. \nনিশ্চয়ই মুত্তাকীদের জন্য রয়েছে সফলতা। -সূরা নাবা : ৩১",
  "وَّ یَرْزُقْهُ مِنْ حَیْثُ لَا یَحْتَسِبُ. \nএবং তাকে রিযিক দান করেন অকল্পনীয়ভাবে। -সূরা ত্বালাক : ৩",
  "اِنَّ اَكْرَمَكُمْ عِنْدَ اللهِ اَتْقٰىكُمْ. \nনিশ্চয়ই আল্লাহর নিকট সবচেয়ে সম্মানিত ব্যক্তি হচ্ছে মুত্তাকীগণ। -সূরা হুজুরত : ১৩",
  "اِنَّ اللهَ یُحِبُّ الْمُتَّقِیْنَ. \nনিশ্চয়ই আল্লাহ মুত্তাকীদেরকে ভালোবাসেন। -সূরা তাওবা : ৪",
  "اِنَّمَا یَتَقَبَّلُ اللهُ مِنَ الْمُتَّقِیْنَ. \nনিশ্চয়ই আল্লাহ মুত্তাকীদের থেকে কবুল করেন। -সূরা মায়েদা (৫) : ২৭",
  "وَ الَّذِیْنَ اتَّقَوْا فَوْقَهُمْ یَوْمَ الْقِیٰمَةِ.\nযাঁরা তাকওয়া অবলম্বন করে তারা কিয়ামতের দিন তাদের (কাফেরদের) উপরে থাকবে। -সূরা বাকারা (২) : ২১২",
  "فَمَنِ اتَّقٰی وَ اَصْلَحَ فَلَا خَوْفٌ عَلَیْهِمْ وَ لَا هُمْ یَحْزَنُوْنَ. \nযারা তাকওয়া অবলম্বন করে এবং সৎ থাকে, তাদের কোনো ভয় নেই এবং তারা কখনো দুঃখিত হবে না। -সূরা আরাফ (৮) : ৩৫",
  "اِنَّ الْمُتَّقِیْنَ فِیْ جَنّٰتٍ وَّ نَهَرٍ،  فِیْ مَقْعَدِ صِدْقٍ عِنْدَ مَلِیْكٍ مُّقْتَدِرٍ. \nযারা তাকওয়া অবলম্বন করেছে তারা থাকবে উদ্যানরাজি ও নহরে। সত্যিকারের মর্যাদাপূর্ণ আসনে, সর্বময় ক্ষমতার অধিকারী মহা সম্রাটের সান্নিধ্যে। -সূরা ক্বমার (৫৪) : ৫৪-৫৫",
  "আর সিয়াম পালন করাই তোমাদের জন্যে অধিকতর কল্যাণকর যদি তোমরা তা জানতে। (সূরা বাকারাহ-১৮৪)",
  "তোমরা নামায প্রতিষ্ঠা কর এবং যাতাক দাও । তোমরা নিজের জন্যে পূর্বে যে সৎ কর্ম প্রেরন করবে, তা আল্লাহ্‌র কাছে পাবে । তোমরা যা কিছু কর, নিশ্চয় আল্লাহ্‌ তা প্রত্যক্ষ করেন ।\n— সূরা আল বাকারা, আয়াতঃ ১১০",
  "হে মুমিন গন ! তোমরা ধৈর্য ও নামাযের মাধ্যমে সাহায্য প্রার্থনা কর । নিশ্চিতই আল্লাহ্‌ ধৈর্যশীলদের সাথেই রয়েছেন ।\n— সূরা আল বাকারা, আয়াতঃ ১৫৩",
  " সমস্ত নামাযের প্রতি যত্নবান হও, বিশেষ করে মধ্যবর্তী নামাযের ব্যাপারে । আর আল্লাহ্‌র সামনে একান্ত আদবের সাথে দাঁড়াও ।\n— সূরা আল বাকারা, আয়াতঃ ২৩৮",
  " হে বনী আদম ! তোমরা প্রত্যেক নামাযের সময় সাজসজ্জা পরিধান করে নাও, খাও ও পান কর এবং অপব্যয় করো না । তিনি অপব্যয়ীদের কে পছন্দ করেন না ।\n— সূরা আল আরাফ, আয়াতঃ ৩১",
  " আর যেসব লোক সুদৃঢ় ভাবে কিতাবকে আঁকড়ে থাকে এবং নামায প্রতিষ্ঠা করে নিশ্চয় আমি বিনষ্ট করবো না সৎ কর্মীদের সওয়াব ।\n— সূরা আল আরাফ, আয়াতঃ ১৭০",
  " আমিই আল্লাহ্‌ আমি ব্যতীত কোন ইলাহ নেই । অতএব আমার এবাদত কর এবং আমার স্মরণার্থে নামায কায়েম কর ।\n— সূরা তোয়া-হা, আয়াতঃ ১৪",
  "নামায কায়েম কর, যাকাত প্রদান কর এবং রসূলদের আনুগত্য কর যাতে তোমরা অনুগ্রহ প্রাপ্ত হও ।\n— সূরা আন নূর, আয়াতঃ ৫৬",
  " সবাই তার অভিমুখী হও এবং ভয় কর, নামায কায়েম কর এবং মুশরিকদের অন্তর্ভুক্ত হয়ো না ।\n— সূরা আর রুম, আয়াতঃ ৩১",
  " হে বতসো, নামায কায়েম কর, সৎকাজে আদেশ দাও, মন্দকাজে নিষেধ কর এবং বিপদ আপদে সবর কর । নিশ্চয় এটা সাহসিকতার কাজ ।\n— সূরা লোকমান, আয়াতঃ ১৭",
  "যারা আল্লাহ্‌র কিতাব পাঠ করে, নামায কায়েম করে, এবং আমি যা দিয়েছি তা থেকে গোপনে ও প্রকাশ্যে ব্যয় করে, তারা এমন ব্যবসা আশা কর, যাতে কখনও লোকসান হবে না ।\n— সূরা ফাতির, আয়াতঃ ২৯",
  "মুমিন গণ, জুমআর দিনে যখন নামাজের আজান দেয়া হয়, তখন তোমরা আল্লাহ্‌র স্মরণের পানে তরা কর এবং বেচাকেনা বন্ধ কর । এটা তোমাদের জন্যে উত্তম যদি তোমরা বুঝ ।\n— সূরা আল জুমুআ, আয়াতঃ ৯",
  "  এ দুনিয়া রং তামাশা ছাড়া কিছুই নয়, আর নিশ্চয়ই আখেরাতের আবাসই হলো প্রকৃত জীবন যদি তারা জানত।- সূরা আনকাবূতঃ৬৪",
  "যে ব্যক্তি ইসলাম ব্যতীত অন্য ধর্মে যেতে চাইবে তার সে ধর্ম কবুল হবে না এবং আখেরাতে সে ব্যক্তি ক্ষতিগ্রস্তদের অন্তর্ভুক্ত হবে। সূরা ইমরানঃ৮৫",
];
List<String> AjkerHadith = [
  "হযরত আবু হুরায়রা (রা.) হতে বর্ণিত। তিনি বলেন, রসূলুল্লাহ (স:) ইরশাদ করেন, তোমাদের নিকট রমজান মাস উপস্থিত। এটা এক অত্যন্ত বরকতময় মাস। আল্লাহ তা’য়ালা এ মাসে তোমাদের প্রতি সাওম ফরজ করেছেন। এ মাসে আকাশের দরজাসমূহ উন্মুক্ত হয়ে যায়, এ মাসে জাহান্নামের দরজাগুলো বন্ধ করে দেওয়া হয় এবং এ মাসে বড় বড় শয়তানগুলোকে আটক রাখা হয়। আল্লাহর জন্যে এ মাসে একটি রাত আছে, যা হাজার মাসের চেয়েও অনেক উত্তম। যে লোক এ রাত্রির মহা কল্যাণলাভ হতে বঞ্চিত থাকল, সে সত্যিই বঞ্চিত ব্যক্তি। (সুনানুন নাসায়ী:২১০৬)",
  " যে ব্যক্তি পরিপূর্ণ বিশ্বাস ও পর্যালোচনাসহ রমজান মাসের সিয়াম পালন করবে, তার পূর্ববর্তী ও পরবর্তী গুণাহ মাফ করে দেওয়া হবে। (সহীহ বুখারী: ৩৮, সহীহ মুসলিম: ৭৬০)",
  "মানুষের প্রত্যেক আমলের প্রতিদান বৃদ্ধি করা হয়। একটি নেকীর সওয়াব দশ গুণ থেকে সাতাশ গুণ পর্যন্ত। আল্লাহ তাআলা ইরশাদ করেন, কিন্তু রোযা আলাদা। কেননা তা একমাত্র আমার জন্য এবং আমি নিজেই এর বিনিময় প্রদান করব। বান্দা একমাত্র আমার জন্য নিজের প্রবৃত্তিকে নিয়ন্ত্রণ করেছে এবং পানাহার পরিত্যাগ করেছে।-সহীহ মুসলিম, হাদীস : ১১৫১ (১৬৪); মুসনাদে আহমদ, হাদীস : ৯৭১৪; মুসান্নাফে ইবনে আবী শাইবা, হাদীস : ৮৯৮৭; সুনানে ইবনে মাজাহ, হাদীস : ১৬৩৮,"
      "‘প্রত্যেক ইবাদতই ইবাদতকারী ব্যক্তির জন্য, পক্ষান্তরে রোযা আমার জন্য। আমি নিজেই এর প্রতিদান দিব। (সহীহ বুখারী হাদীস-১৯০৪)",
  "আল্লাহ তাআলা বলেন, রোযা আমার জন্য, আমি নিজেই এর প্রতিদান দিব। কেয়ামতের দিন রোযাদারদের জন্য একটি বিশেষ পানির হাউজ থাকবে, যেখানে রোযাদার ব্যতীত অন্য কারো আগমন ঘটবে না।-মুসনাদে বাযযার, হাদীস : ৮১১৫;  মাজমাউয যাওয়াইদ, হাদীস : ৫০৯৩",
  "হযরত হুযায়ফা রা. বলেন, আমি আল্লাহর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামকে আমার বুকের সাথে মিলিয়ে নিলাম, তারপর তিনি বললেন, যে ব্যক্তি লাইলাহা ইল্লাল্লাহু’ বলে মৃত্যুবরণ করবে সে জান্নাতে প্রবেশ করবে, যে ব্যক্তি আল্লাহর সন্তুষ্টি কামনায় একদিন রোযা রাখবে, পরে তার মৃত্যু হয় সে জান্নাতে প্রবেশ করবে। যে ব্যক্তি আল্লাহর সন্তুষ্টির উদ্দেশ্যে কোনো দান-সদকা করে তারপর তার মৃত্যু হয়, সে জান্নাতে প্রবেশ করবে।-মুসনাদে আহমদ, হাদীস : ২৩৩২৪; মুসনাদে বাযযার, হা.২৮৫৪",
  "জান্নাতে একটি দরজা আছে, যার নাম রাইয়ান। কিয়ামতের দিন এ দরজা দিয়ে কেবল রোযাদার ব্যক্তিরাই প্রবেশ করবে। অন্য কেউ প্রবেশ করতে পারবে না। ঘোষণা করা হবে- কোথায় সেই সৌভাগ্যবান রোযাদারগণ? তখন তারা উঠে দাড়াবে। তারা ব্যতীত কেউ এ দরজা দিয়ে প্রবেশ করতে পারবে না। অতঃপর রোযাদারগণ যখন প্রবেশ করবে, তখন তা বন্ধ করে দেওয়া হবে। ফলে কেউ ঐ দরজা দিয়ে প্রবেশ করতে পারবে না।-সহীহ বুখারী, হাদীস : ১৮৯৬; সহীহ মুসলিম, হাদীস : ১১৫২; মুসনাদে আহমদ, হাদীস : ২২৮১৮",
  "জান্নাতে রোযাদার ব্যক্তিদের জন্য একটি বিশেষ দরজা আছে, যার নাম রাইয়ান। রোযাদারগণ ছাড়া অন্য কেউ এই দরজা দিয়ে প্রবেশ করতে পারবে না। যখন সর্বশেষ রোযাদার ব্যক্তি তাতে প্রবেশ করবে, তখন সেই দরজা বন্ধ করে দেওয়া হবে। যে ব্যক্তি ঐ দরজা দিয়ে প্রবেশ করবে, সে (জান্নাতের পানীয়) পান করবে। আর যে পান করবে, সে কখনো পিপাসার্ত হবে না।-মুসনাদে আহমদ, হাদীস : ২২৮৪২; সহীহ ইবনে খুযায়মা, হাদীস : ১৯০২; সুনানে তিরমিযী, হাদীস : ৭৬৫; সুনানে নাসায়ী, হাদীস : ২৫৪৪",
  "আমাদের মহান রব ইরশাদ করেছেন- রোযা হল ঢাল। বান্দা এর দ্বারা নিজেকে জাহান্নামের আগুন থেকে রক্ষা করবে। রোযা আমার জন্য আর আমিই এর পুরস্কার দিব।-মুসনাদে আহমদ, হাদীস : ১৪৬৬৯; শুয়াবুল ঈমান বাইহাকী, হাদীস : ৩৫৭০",
  "الصيام جنة من النار كجنة احدكم من القتال، \nরোযা হল জাহান্নাম থেকে রক্ষাকারী ঢাল, যুদ্ধক্ষেত্রে তোমাদের (শত্রুর আঘাত হতে রক্ষাকারী) ঢালের মত।-মুসনাদে আহমদ, হাদীস : ১৬২৭৮; সহীহ ইবনে খুযাইমা, হাদীস : ২১২৫; সহীহ ইবনে হিববান, হাদীস : ৩৬৪৯; সুনানে ইবনে মাজাহ, হাদীস : ১৬৩৯",
  "من صام رمضان ايمانا واحتسابا غفر له ما تقدم من ذنبه، \nযে ব্যক্তি ঈমানের সাথে সওয়াবের আশায় রমযান মাসের রোযা রাখবে, তার পূর্ববর্তী গুনাহসমূহ ক্ষমা করে দেওয়া হবে।- সহীহ বুখারী, হাদীস : ৩৮, ২০১৪; সহীহ মুসলিম ৭৬০(১৬৫); মুসনাদে আহমদ, হাদীস : ৭১৭০; মুসান্নাফে ইবনে আবী শাইবা, হাদীস : ৮৯৬৮",
  " আল্লাহ তাআলা তোমাদের উপর রমযানের রোযা ফরয করেছেন, আর আমি কিয়ামুল লাইল অর্থাৎ তারাবীহ’র নামাযকে সুন্নত করেছি। সুতরাং যে ব্যক্তি ঈমানের সাথে সওয়াবের আশায় রমযানের সিয়াম ও কিয়াম আদায় করবে, সে ঐ দিনের মতো নিষ্পাপ হয়ে যাবে যেদিন সে মায়ের গর্ভ থেকে সদ্যভূমিষ্ঠ হয়েছিল।-মুসনাদে আহমদ, হাদীস-১৬৬০, মুসান্নাফে ইবনে আবি শাইবা, হাদীস-৭৭৮৭, মুসনাদে বাযযার, হাদীস-১০৪৮, সহীহ ইবনে খুযাইমা, হাদীস-২২০১, সুনানে নাসায়ী, হাদীস-২৫১৮"
      "والذى نفس محمد بيده لخلوف فم الصائم اطيب عند الله من ريح المسك، \nসেই সত্তার শপথ, যার হাতে মুহাম্মাদের জীবন, রোযাদারের মুখের দুর্গন্ধ আল্লাহর নিকট মিশকের সুগন্ধির চেয়েও অধিক সুগন্ধিময়।-সহীহ বুখারী, হাদীস : ১৯০৪; সহীহ মুসলিম, হাদীস : ১১৫১ (১৬৩); মুসনাদে আহমদ, হাদীস : ৭১৭৪; সুনানে নাসায়ী, হাদীস : ২৫২৩; সুনানে ইবনে মাজাহ- ১৬৩৮",
  "রোযাদারের জন্য দুটি আনন্দের মুহূর্ত রয়েছে, যখন সে আনন্দিত হবে। এক. যখন সে ইফতার করে তখন ইফতারের কারণে আনন্দ পায়। দুই. যখন সে তার রবের সাথে মিলিত হবে তখন তার রোযার কারণে আনন্দিত হবে। অন্য বর্ণনায় রয়েছে, যখন সে আল্লাহর সাথে মিলিত হবে, আর তিনি তাকে পুরস্কার দিবেন, তখন সে আনন্দিত হবে।-সহীহ বুখারী, হাদীস : ১৯০৪, ১৮৯৪; সহীহ মুসলিম, হাদীস : ১১৫১ (১৬৩, ১৬৪, ১৬৫); মুসনাদে আহমদ, হাদীস : ৯৪২৯, ৭১৭৪; সুনানে তিরমিযী, হাদীস : ৭৬৬",
  "ইফতারের সময় রোযাদার যখন দুআ করে, তখন তার দুআ ফিরিয়ে দেওয়া হয় না। (অর্থাৎ তার দুআ কবুল হয়)।-সুনানে ইবনে মাজাহ, হাদীস : ১৭৫৩",
  "রোযাদারের দুআ ফিরিয়ে দেওয়া হয় না।-মুসান্নাফে ইবনে আবী শাইবা, হাদীস : ৮৯৯৫"
];

List<String> SalafQoutes = [
  "হযরত আলী রা. বলেন- যে ব্যক্তি ইচ্ছাকৃতভাবে রমযান মাসের একটি রোযা ভঙ্গ করবে, সে আজীবন সেই রোযার (ক্ষতিপূরণ) আদায় করতে পারবে না।-[মুসান্নাফে ইবনে আবী শাইবা, হাদীস : ৯৮৭৮]",
  "হযরত আব্দুল্লাহ ইবনে মাসউদ রা. বলেন, যে ব্যক্তি অসুস্থতা ও সফর ব্যতীত ইচ্ছাকৃতভাবে রমযানের একটি রোযাও ভঙ্গ করে, সে আজীবন রোযা রাখলেও ঐ রোযার হক আদায় হবে না।[মুসান্নাফে ইবনে আবী শাইবা : ৯৮৯৩; মুসান্নাফে আব্দুর রাযযাক : ৭৪৭৬; সহীহ বুখারী ৪/১৬০]",
  "জ্ঞানের ভিত্তি হলো মহান আল্লাহর প্রতি ভয় (তাকওয়া)।\n— ইমাম আহমাদ ইবনে হাম্বল (রাহিমাহুল্লহ)",
  "আল্লাহকে ভয় করো, কারণ যে তাকে ভয় করে সে কখনো একাকীত্ব অনুভব করে নাহ।\n— উমর ইবনুল খাত্তাব (রাঃ)",
  "কোন ব্যক্তির তাকওয়া (আল্লাহভীতি) না থাকলে সে যদি বিবাহিত হয় তবুও দৃষ্টিকে সংযত করে না। তাকওয়াসম্পন্ন মানুষ যদি অবিবাহিতও থাকে, সে তার দৃষ্টিকে সংযত করে।\n— ওমর সুলাইমান",
  "একজন মানুষের অন্তর যদি রোগগ্রস্ত না হয় তাহলে সে কোনদিন, কোন অবস্থাতেই আল্লাহ সুবহানাহু ওয়া তা’আলা ছাড়া অন্য কাউকে ভয় পাবে না\n— ইমাম ইবনে তাইমিয়া (রহঃ)",
  "আপনি যখন কোন সৃষ্টিকে ভয় করবেন তখন তার থেকে দূরে পালাতে চেষ্টা করবেন। আপনি যখন আল্লাহকে ভয় করবেন তখন তাকে ভালোবাসবেন এবং তার সাথে ঘনিষ্ট হওয়ার চেষ্টা করবেন।\n— ইমাম ইবনুল কাইয়্যিম (রহিমাহুল্লহ)",
  " যাকে আল্লাহভীতি দান করে সম্মানিত করা হয়নি তার আর কোনো সম্মানই নেই।\n— ইমাম শাফেয়ী (রহঃ)",
  " আল্লাহর প্রত্যেকটি ফয়সালাই ন্যায়বিচারের ওপর ভিত্তিশীল। সুতরাং কোন অবস্থাতেই অভিযোগের ভাষা যেন তোমার মুখে উচ্চারিত না হয়।\n— ইমাম গাজ্জালী (রহঃ)",
  "নিজেকে আল্লাহর রাহমাতসমূহের কথা বেশি করে স্মরণ করিয়ে দিন, কেননা যিনি বেশি বেশি স্মরণ করেন তার কৃতজ্ঞতা প্রকাশ করার সম্ভাবনাও বেশি থাকে।\n— উমার বিন আবদুল আজিজ (রাহিমাহুল্লাহ)",
  " তোমরা কি আমাকে দারিদ্রতার কথা ভাবিয়ে ভয় দেখাতে চেষ্টা করছ যখন যে একমাত্র বিষয় সুফিয়ান ভয় করে তা হলো এই দুনিয়ার সম্পদ তার উপরে ঢেলে দেয়া হবে\n— ইমাম সুফিয়ান আস-সাওরি (রহঃ)",
  " সে-ই প্রকৃত পুরুষ যে আল্লাহর জন্য কাঁদে।\n— ওমর সুলাইমান",
  "কারো সাথে কথোপকথনে বিনয়ী হওয়াটা একজন ব্যক্তির জন্য আবশ্যক।\n— ইমাম আল-কুরতুবী (রহিমাহুল্লাহ)",
  "কোনো ভাল কাজকে কখনই ছোট করবেন না, কারণ আপনি জানেন না কোন হাসানাহ আপনার জান্নাতের টিকিট হবে। -মুহাম্মদ নুসাইর",
  "আমরা দুনিয়ার ভোগ বিলাসের জন্য দোয়া করি। যখন রহমতের দরজা খোলা হয় না তখন আমরা কান্নায় ভেঙে পড়ি। আমরা বুঝি না আমাদের জন্য আল্লাহ জান্নাতের দরজা খুলে দিয়েছেন। -ইয়াসমিন মোগাহেদ",
  "মানুষকে সৃষ্টি করা হয়েছে আখেরাতের জন্য, দুনিয়ার জন্য নয়। \nসংগৃহীত",
  "দুনিয়াতে সামান্য কিছুর জন্য আখেরাতকে ভুলে যেও না। \nসংগৃহীত",
  "আমাদের জীবন আমাদের জন্য নয়, আমাদের জীবন আল্লাহর জন্য। \nসংগৃহীত",
  "দুনিয়ার নেয়ামত অল্প এবং আখেরাতের নেয়ামত অফুরন্ত। \nসংগৃহীত",
  "দুনিয়া এমন একটি নদী যার যাত্রী তারাই যার তীরে আখেরাত এবং যার নৌকা তাকওয়া। \nসংগৃহীত",
  "এই জীবনের মাধুর্য পাওয়া যায় আল্লাহকে স্মরণে; আখেরাতের মাধুর্য পাওয়া যায় তাকে দর্শনে। \nইয়াসির কাদি",
  "সাহাবাদের অন্তরে দুনিয়ার উপস্থিতি ছিলো শূন্য কিন্তু তাতে আখেরাত ছিলো পরিপূর্ণ।\n ইবনে রজব আল হানবলী",
  "দুনিয়া নিয়ে দুঃশ্চিন্তা করা অন্তর অন্ধকারাচ্ছন্ন, আর আখেরাত নিয়ে দুঃশ্চিন্তা করা অন্তর আলোকিত। \nহযরত উসমান (রাঃ)",
  "দুনিয়ার প্রেমে আল্লাহকে পাওয়া যায় না, কিন্তু আল্লাহর প্রেমে দুনিয়া ও আখেরাত উভয়ই পাওয়া যায়। \nসংগৃহীত",
  "যে নিজেকে স্মার্ট দাবি করে কিন্তু আখেরাতের দিকে মনোযোগ দেয় না, সে মিথ্যা বলছে। ওয়াহব ইবনে মুনাবীহ (রঃ)",
  "যেসব পাপ কাজ তোমরা গোপনে করে থাকো সেগুলোকে ভয় করো, কেননা সেসব পাপের সাক্ষী বিচারক স্বয়ং নিজেই ।\n— আলী ইবনে আবু তালিব (রাঃ)",
  "পাপ কাজ গুলো মানুষের চেহারাকে কুৎসিত করে দেয় ।\n— ইমাম ইবনে তাইমিয়া (রহঃ)",
  "কল্যানপ্রাপ্ত তো সেই ব্যক্তি যার নিজের পাপ সমূহ তাকে অন্যদের পাপের দিকে অঙ্গুলি নির্দেশ থেকে বিরত রাখে ।\n— আলী ইবনে আবু তালিব (রাঃ)",
  "ঈমানদারদের জীবন ক্রমাগত বিভিন্ন কঠিন পরীক্ষার মুখােমুখি করানাে হয় তাদের ঈমানকে বিশুদ্ধ এবং তাদের পাপকে মােচন করানাের জন্য। কারণ, ঈমানদারগণ তাদের জীবনের প্রতিটি কাজ করেন কেবলমাত্র আল্লাহর সন্তুষ্টির জন্য; আর তাই জীবনে সহ্য করা এই দুঃখ-কষ্টগুলাের জন্য তাদের পুরষ্কার দেয়া আল্লাহর জন্য অপরিহার্য হয়ে যায়।\n— ইমাম ইবনে তাইমিয়া (রহঃ)"
      "পাপ হলাে শেকলের মতন যা পাপকারীকে আটকে রাখে যেন সে তাওহীদের বিশাল বাগানে বিচরণ করতে এবং সেখানকার ফল সৎকর্মসমূহকে সংগ্রহ করতে না পারে।\n— ইমাম ইবনে তাইমিয়া (রহঃ)",
  "পাপকাজের অনেক পার্শ্বপ্রতিক্রিয়া রয়েছে, তার মধ্যে একটি হলাে তা আপনার কাছ থেকে জ্ঞান। ছিনিয়ে নেবে।\n— ইমাম ইবনুল কাইয়্যিম (রাহিমাহুল্লাহ)",
  "আমাদের পুর্ব প্রজন্মের একজন মানুষ বলেছিলেন, খারাপ কাজের একটি শাস্তি হলাে আরাে খারাপ কাজ হওয়া এবং ভালাে কাজের একটি পুরষ্কার হলাে আরাে ভালাে কাজ হওয়া ।\n— ইমাম ইবনুল কাইয়্যিম (রাহিমাহুল্লাহ)"
      "প্রতিটি পাপ আরাে অনেক পাসের জন্ম দেয়, একটি পাপ আরেকটি পাপের দিকে নিয়ে যেতে থাকে যতক্ষণ না পর্যন্ত সেই পাপরাশি মানুষটিকে এমনভাবে কাবু করে ফেলে যে কৃত পাপগুলাের জন্য তাওবা করাকে তার কাছে কঠিন বলে মনে হয়।\n— ইমাম ইবনুল কাইয়্যিম (রাহিমাহুল্লাহ)"
      "একজন পাপাচারী লােক তার পাপের জন্য অনুতপ্ত হয়না। কারণ তার অন্তর ইতােমধ্যেই মরে গেছে ।\n— ইমাম ইবনুল কাইয়্যিম (ব্রাহিমাহুল্লাহ)",
  " যে ভালাে কাজের ফলে অন্তরে অহংকার সৃষ্টি হয় তার চাইতে যে পাপের জন্য কোন ব্যক্তি আল্লাহর কাছে তার আত্মাকে সমর্পিত করে সেটি আল্লাহর কাছে বেশি পছন্দের ।\n— ইমাম ইবনুল  কাইয়্যিম (রাহিমাহুল্লাহ)",
  " আয়নায় নিজের চেহারা দেখ, যদি সুদর্শন হও তবে পাপের কালিমা লেপন করে ওকে কুৎসিত করাে ! আর যদি কালাে-কুশ্রী হয়ে থাক, তবে ওকে পাপ-পঙ্কিলতা মেখে আরও বীভৎস করে তুলাে না।\n— ইমাম গজ্জালী (রহঃ)",
  "আমি এমন মানুষদের (সাহাবা) সান্নিধ্য অর্জন করেছিলাম যারা তাদের কোন সৎকাজকে ছেড়ে দেয়া যতটা ভয় করতেন তা তােমরা তােমাদের পাপকাজের পরিণামকে যতটুকু ভয় কর তার চাইতেও বেশি।\n— আল হাসান আল-বামী (রাহিমাহুল্লাহ)",
  "কোন পাপ করার জন্য আপনার কামনা যত বড় হবে, সেই পাপকে এড়িয়ে গেলে আপনার ঈমান তত বড় হবে।\n— সালিহ আল-উমাইমিন (রহিমাহুল্লাহ)",
  "যদি আকাঙ্ক্ষা করেন আপনার সম্পদ বৃদ্ধি হােক এবং আপনার পাপগুলাে ক্ষমা হোক, তাহলে আপনার সাদাকাহ (দান) করা উচিত।\n— সালিহ আল-উসাইমিন (রহিমাহুল্লাহ)",
  "জঘন্য পাপগুলাের একটি হলাে যখন একজন মানুষ তার অপর ভাইকে বলে, “আল্লাহকে ভয় করাে” এবং সে তার জবাবে বলে, “তােমার নিজেকে নিয়ে চিন্তা করাে।\n— আব্দুল্লাহ বিন মাসউদ (রাদিয়াল্লাহু আনহু)",
  " সন্তানদের জন্য বিয়েকে সহজ করে দেয়া আমাদের জন্য ইবাদাত স্বরূপ৷ আর তাদের জন্য বিয়েকে কঠিন করে ফেলা একটি পাপ, যা অন্যান্য আরাে অনেক পাসের জন্ম দেয়।\n— ইসমাইল ইবন মুসা ",
  "‘সন্দেহ নেই, মৃত্যু অনেক বড় মুসিবত। কিন্তু তারচেয়েও বড় মুসিবত হলো, মৃত্যু সম্পর্কে গাফেল হওয়া ও মৃত্যুর জন্যে আমল না করা।’\n–ইমাম কুরতুবি (রহিমাহুল্লহ)",
];
//  todays_dua = Dua_Items[_random.nextInt(Dua_Items.length)];

List<Map<String, dynamic>> Qadr_Data = [
  {
    "title": "কদরের রাতে পড়ার বিশেষ দু‘আটি বেশি বেশি পড়া",
    "description":
        "اَللّٰهُمَّ إِنَّكَ عَفُوٌّ تُحِبُّ الْعَفْوَ فَاعْفُ عَنِّيْ \n[আল্লাহুম্মা ইন্নাকা ‘আফুউ-উন, তু‘হিব্বুল ‘আফওয়া ফা‘অ্ফু ‘আন্নী] \nহে আল্লাহ্! তুমি ক্ষমাশীল, তুমি ক্ষমা করতে পছন্দ করো। অতএব, আমাকে ক্ষমা করে দাও। [ইবনে মাজাহ, আস-সুনান: ৩৮৫০]",
    "isChecked": false
  },
  {
    "title": "চারজন গোলামকে মুক্তি",
    "description":
        "যে ব্যক্তি  “লা- ইলা-হা ইল্লাল্ল-হু ওয়াহ্দাহু লা- শারীকা লাহু লাহুল মুলকু ওয়ালাহুল হাম্দু ওয়াহুয়া ‘আলা- কুল্লি শাইয়্যিন ক্বদীর।”\nلَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ১০ বার পাঠ করবে সে যেন ইসমা‘ঈল (‘আঃ)-এর বংশের চারজন গোলামকে মুক্তি করে দিলেন। [তিরমিযি ৩৫৫৩][মুসলিম ৬৭৩৭,২৬৯৩][ইবনে মাজাহ ৩৮৬৭][বুখারীঃ ৬৪০৩]",
    "isChecked": false
  },
  {
    "title":
        "১০জন গোলাম  মুক্ত করার পুন্য অর্জন এবং ১০০ নেকি এবং ১০০ পাপ মোচন হবে",
    "description":
        "যে ব্যক্তি  “লা- ইলা-হা ইল্লাল্ল-হু ওয়াহ্দাহু লা- শারীকা লাহু লাহুল মুলকু ওয়ালাহুল হাম্দু ওয়াহুয়া ‘আলা- কুল্লি শাইয়্যিন ক্বদীর।”\nلَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ১০০ বার পাঠ করলে ১০জন গোলাম  মুক্ত করার পুন্য অর্জন এবং ১০০ নেকি এবং ১০০ পাপ মোচন হবে!  [মুসলিম ৬৭৩৫]",
    "isChecked": false
  },
  {
    "title": "সমুদ্রের ফেনা সমপরিমাণ পাপ ক্ষমা",
    "description":
        "'সুবহা-নাল্লহি ওয়া বিহামদিহি' ১০০ বার পাঠ করলে পাপ ক্ষমা করা হয় যদি তা সমুদ্রের ফেনা সমপরিমাণও হয়!পাশাপাশি সর্বোত্তম আমলের অধিকারী হওয়া যায়! [বুখারীঃ ৬৪০৫][মুসলিম ৬৭৩৫,৬৭৩৬]\nسُبْحَانَ اللَّهِ وَبِحَمْدِهِ",
    "isChecked": false
  },
  {
    "title": "মিযানের পাল্লা ভারী করার আমল",
    "description":
        " সুবহা-নাল্লহি ওয়া বিহামদিহি সুবহা-নাল্লহিল 'আযীম` [বুখারীঃ ৬৪০৬] [মুসলিম ৬৭৩৯]\nسُبْحَانَ اللَّهِ وَبِحَمْدِهِ، سُبْحَانَ اللَّهِ الْعَظِيمِ",
    "isChecked": false
  },
  {
    "title": "১০০০ পাপ মোচন+১০০০ পুন্য অর্জন করার আমল",
    "description":
        " ১০০ বার 'সুবহা-নআল্লহ' বলা [মুসলিম ৬৭৪৫,২৬৯৮]\nسُبْحَانَ اللَّهِ",
    "isChecked": false
  },
  {
    "title": "জান্নাতের গুপ্তধন",
    "description":
        "'লা- হাওলা ওয়ালা- ক্বুওয়্যাতা ইল্লা বিল্লাহ' [বুখারীঃ ৬৩৮৪][মুসলিম ৬৭৫৫,৬৭৫৬][জামে' তিরমিজি ৩৩৭৪,৩৪৬১]\nلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ",
    "isChecked": false
  },
  {
    "title": "৭০ প্রকার অনিষ্ট থেকে বাচার আমল",
    "description":
        "“লা হাওলা ওয়ালা কুওয়াতা ইল্লা বিল্লাহ ওয়ালা মানজায়া মিনাল্লাহি ইল্লা ইলাইহি”  পাঠ করা[তিরমিযি ৩৬০১]",
    "isChecked": false
  },
  {
    "title": "সর্বশ্রেষ্ঠ দোয়া",
    "description":
        "اَلْحَمْدُ لِلَّهِ আল-‘হামদু লিল্লা-হ [তিরমিযীঃ ৩৩৮৩][হাসান]",
    "isChecked": false
  },
  {
    "title": "সর্বোত্তম যিক্‌র",
    "description":
        "لَا إِلَهَ إِلَّا اللَّهُ লা- ইলা-হা ইল্লাল্লহ [তিরমিযীঃ ৩৩৮৩][হাসান]",
    "isChecked": false
  },
  {
    "title": "চিরস্থায়ী নেক আমল",
    "description":
        "سُبْحَانَ اللَّهِ، وَالْحَمْدُ لِلَّهِ، وَلَا إِلَهَ إِلَّا اللَّهُ، وَاللَّهُ أَكْبَرُ، لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ \n সুবহা-নাল্লহ, ওয়াল‘হামদু লিল্লাহ, ওয়া লা-ইলা-হা ইল্লাল্লহ, ওয়াল্লহু আকবার, লা- হাওলা ওয়ালা- ক্বুওয়্যাতা ইল্লা বিল্লাহ [মুসনাদে আহমাদ ৫১৩]মাজমাউয যাওয়ায়িদ, ১/২৯৭][আস-সুনানুল কুবরা ১০৬১৭][ইবনে হিব্বান ৮৪০] [হাকিম ১/৫৪১]",
    "isChecked": false
  },
  {
    "title": "বিচারের দিন সাক্ষ্য দিবে",
    "description":
        "সূরা বাকারা, সূরা আল ইমরান পাঠ করার চেষ্টা করুন। বিচারের দিন কুরআন,তন্মদ্যে সূরা বাকারা,সূরা আল ইমরান আগেবাগে  পাঠকারীর পক্ষে সাক্ষ্য দিবে! [মুসলিম ৮০৫][তিরমিযী ২৮৮৩][রিয়াদুস সলেহীন ৯৯৯][আহমাদ ১৭১৮৫]",
    "isChecked": false
  },
  {
    "title": "কুরআনের এক-তৃতীয়াংশ",
    "description":
        "সুরা ইখলাস পাঠ করলে কুরআনের এক-তৃতীয়াংশ পাঠ করা হয়![মুসলিম ৮১২][তিরমিযী ২৮৯৯,২৯০০] [রিয়াদুস সলেহীন ১০১৯][ইবনে মাজাহ ৩৭৮৭][আহমাদ ৯২৫১][দারেমী ৩৪৩২]",
    "isChecked": false
  },
  {
    "title": "বেশি বেশি সূরা ইখলাস পাঠ",
    "description":
        "বেশি বেশি সূরা ইখলাস পাঠ করবেন।সূরা ইখলাসের প্রতি ভালোবাসা জান্নাতে প্রবেশ করাবে!  [রিয়াদুস সলেহীন ১০২০]",
    "isChecked": false
  },
  {
    "title": "সুপারিশ",
    "description":
        "সূরা  মুলক পাঠকারীর স্বপক্ষে সুপারিশ করবে যতক্ষণ পর্যন্ত না ক্ষমা করে দেওয়া হয়![রিয়াদুস সলেহীন ১০২৩]",
    "isChecked": false
  },
  {
    "title": "যথেষ্ট হবে",
    "description":
        "রাতে সূরা বাকারার শেষ দুই আয়াত পাঠ করলে তা তার জন্য যথেষ্ট হবে!  [রিয়াদুস সলেহীন ১০২৪]",
    "isChecked": false
  },
  {
    "title": "প্রতি ওয়াক্ত ওঝু করে পাঠ",
    "description":
        "প্রতি ওয়াক্ত ওঝু করে 'আশহাদু আল্লা ইলাহা ইল্লাল্লাহু ওয়াহদাহু লা শারীকালাহু ওয়া আশহাদু আন্না মুহাম্মাদান আবদুহু ওয়া রসুলুহু' পাঠ করবে  তার জন্য জান্নাতের সবগুলো দরজা (৮টি ই) খোলা থাকবে, সে যেকোনোটি দিয়ে প্রবেশ করতে পারবে! [রিয়াদুস সলেহীন ১০৩৯][মুসলিম ২৩৪][তিরমিযী ৫৫][নাসায়ী ১৪৮,১৫১][আবু দাউদ ১৬৯,৯০৬][ইবনে মাজাহ ৪৭০] [আহমাদ ১৬৯১২,১৬৯৪২,১৬৯৯৫]",
    "isChecked": false
  },
  {
    "title": "সুপারিশ করা হবে",
    "description":
        "প্রতিবার আযানের জবাব দিয়ে দুরুদ পাঠ করলে ১০ টি রহমত এবং এরপর অসীলা প্রার্থনা করলে  তার জন্য সুপারিশ করা হবে! [রিয়াদুস সলেহীন ১০৪৪][বুখারী ৬১১,৩৮৩][তিরমিযী ২০৮] [নাসায়ী ৬৭৩][আবু দাউদ ৫২২] [ইবনু মাজাহ ৭২০][দারেমী ১২০১]",
    "isChecked": false
  },
  {
    "title": " জান্নাতে ১ টি স্বর্ণের প্রাসাদ গড়ে তোলার আমল",
    "description":
        "আপনার জান্নাতে ১ টি স্বর্ণের প্রাসাদ গড়ে তোলার আমল: ১০ বার সুরা ইখলাস পাঠ করা [দারিমী ৩৪২৯][আহমাদ ১৫১৮৩]",
    "isChecked": false
  },
  {
    "title": "জাহান্নাম থেকে মুক্তি এবং জান্নাতে স্বর্ণের গাছ রোপন করানোর আমল",
    "description":
        "জাহান্নাম থেকে মুক্তি এবং জান্নাতে স্বর্ণের গাছ রোপন করানোর আমল: 'সুবহা-নআল্লহি ওয়াল হামদু লিল্লাহি ওয়া লা- ইলাহা ইল্লাল্লহু ওয়াল্লহু আকবার' পাঠ করা[তাগরীব ১৫৪৯] [হাকীম ৭৮৬]",
    "isChecked": false
  },
  {
    "title": "জান্নাতে ১ টি খেজুর গাছ রোপন করার আমল",
    "description":
        "`সুবহা-নাল্লহিল 'আযীম ওয়া বিহামদিহী` (سُبْحَانَ اللَّهِ الْعَظِيمِ وَبِحَمْدِهِ) পাঠ করা [তিরমিজি ৩৪৬৪,৩৪৬৫][রওযুন নাযীর ২৪৩][সহীহা-৬৪] [রিয়াদুস সলেহীন ১৪৪৭]",
    "isChecked": false
  },
  {
    "title": "বেশি বেশি তাওবা ইস্তিগফার করুন।",
    "description":
        "বেশি বেশি তাওবা ইস্তিগফার করুন।‘প্রত্যেক আদম সন্তানই বারবার ভুল করে। আর ভুলকারীদের মধ্যে সর্বোত্তম হলো সেই ব্যক্তি, যে ভুলের পর তাওবা করে।’ [তিরমিযী:২৪৯৯][ইবনে মাজাহ:৪২৫১]  [আহমাদ:১৩০৪৯]",
    "isChecked": false
  },
  {
    "title": "মারা গেলে সে জান্নাতী হবে",
    "description":
        "রসূলুল্লাহ (স) বলেন, ‘যে ব্যক্তি দৃঢ় বিশ্বাসের সাথে এই দো‘আ পাঠ করবে, দিনে পাঠ করে রাতে মারা গেলে কিংবা রাতে পাঠ করে দিনে মারা গেলে, সে জান্নাতী হবে’।\nاَللَّهُمَّ أَنْتَ رَبِّىْ لآ إِلهَ إلاَّ أَنْتَ خَلَقْتَنِىْ وَأَنَا عَبْدُكَ وَأَنَا عَلى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوْذُبِكَ مِنْ شَرِّمَا صَنَعْتُ، أبُوْءُ لَكَ بِنِعْمَتِكَ عَلَىَّ وَأَبُوْءُ بِذَنْبِىْ فَاغْفِرْلِىْ، فَإِنَّهُ لاَيَغْفِرُ الذُّنُوْبَ إِلاَّ أَنْتَ(আল্লা-হুম্মা আংতা রব্বী লা- ইলা-হা ইল্লা আংতা খালাক্বতানী-, ওয়া আনা- ‘আবদুকা ওয়া আনা- ‘আলা- ‘আহদিকা ওয়া ওয়া‘দিকা মাসতাত্ব‘তু, আ‘ঊযুবিকা মিং শার্রি মা- স্বনা‘তু। আবূউ লাকা বিনি‘মাতিকা ‘আলাইয়্যা ওয়া আবূ-উ বিযাম্বী ফাগফিরলী- ফাইন্না--হূ  লা- ইয়াগফিরুয্ যুনূবা ইল্লা আংতা।)",
    "isChecked": false
  },
  {
    "title": "জান্নাত লাভ ও জাহান্নাম থেকে আশ্রয় চাওয়া",
    "description":
        "اَللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَأَعُوذُ بِكَ مِنَ النَّارِ\nআল্লা-হুম্মা ইন্নী- আসআলুকাল জান্নাতা ওয়া আ‘উযু বিকা মিনান্না-র [ইবনু মাজাহঃ ৯১০]",
    "isChecked": false
  },
  {
    "title": "দ্বীনের উপর অটল থাকার দোয়া",
    "description":
        "يَا مُقَلِّبَ الْقُلُوبِ ثَبِّتْ قَلْبِيْ عَلَى دِيْنِكَ(ইয়া- মুক্বল্লিবাল ক্কুলূবি সাব্‌বিত ক্কল্‌বী- ‘আলা- দী-নিক্‌)\nহে অন্তরসমূহের পরিবর্তনকারী! আমার অন্তরকে তোমার দ্বীনের উপর অটল রাখো।[তিরমিযীঃ ৩৫২২]",
    "isChecked": false
  },
  {
    "title": "ইসলামের উপর অবিচল থাকার দোয়া",
    "description":
        "يَا وَلِيَّ الْإِسْلَامِ وَأَهْلِهُ ثَبِّتْنِيْ بِهِ حَتّٰى أَلْقَاكَ.(ইয়া- ওয়ালিয়্যাল ইসলা-মি ওয়া আহ্‌লিহু ছাব্বিতনী বিহী হাত্‌তা আলক্ব-কা।)[সিলসিলাতুস সহিহাহ ১৮২৩]",
    "isChecked": false
  },
  {
    "title": "গুনাহ মাফ চাওয়া ",
    "description":
        "أَسْتَغْفِرُ اللَّهَ الْعَظِيمَ الَّذِي لَا إِلَهَ إِلَّا هُوَ الْحَىُّ الْقَيُّوْمُ وَأَتُوبُ إِلَيْهِ (আসতাগফিরুল্লা-হাল 'আযী-মাল্লাযী- লা- ইলা-হা ইল্লা-হুয়াল ‘হাইয়্যুল ক্বইয়্যুমু ওয়া আতূ-বু ইলাইহি)\nনবী (ﷺ) বলেছেন, 'যে লোক বলে, উপোরক্ত দোয়াটি বলে, তাকে ক্ষমা করে দেয়া হয়, যদিও সে রণক্ষেত্র হতে পলায়ন করে থাকে।'[তিরমিযিঃ ৩৫৭৭]",
    "isChecked": false
  },
  {
    "title": "রসুল(স) এই ইস্তিগফারটি বেশি করতেন",
    "description":
        "أَسْتَغْفِرُ اللّٰهَ وَأَتوبُ إِلَيْهِ[আসতাগফিরুল্লহা ওয়া আতূ-বু ইলাইহি] আমি আল্লাহর নিকট ক্ষমা চাচ্ছি এবং তাঁর নিকট তাওবাহ্ করছি[ আস-সহিহ: ৯২৮]",
    "isChecked": false
  },
  {
    "title": "রসুল (স) মৃত্যুর আগে এই ইস্তিগফারটি খুব বেশি পড়তেন",
    "description":
        "سُبْحَانَ اللّٰهِ وَبِحَمْدِهِ أَسْتَغْفِرُ اللّٰهَ وَأَتُوبُ إِلَيْهِ [সুব‘হা-নাল্লাহি ওয়া বি‘হামদিহি, আসতাগফিরুল্লহা ওয়া আতূ-বু ইলাইহি] আমি আল্লাহর প্রশংসাসহ পবিত্রতা ঘোষণা করছি। আল্লাহর নিকট ক্ষমা প্রার্থনা করছি এবং তাঁর নিকট তাওবাহ করছি। [ আস-সহিহ: ৯৭৫]",
    "isChecked": false
  },
  {
    "title": "রসুল (স) এর উপর বেশি বেশি দরুদ পাঠ।",
    "description":
        "রসুল(সঃ) বলেন, ‘‘যে ব্যক্তি আমার প্রতি একবার দরুদ পাঠ করবে, আল্লাহ তার প্রতি ১০ বার রহমত বর্ষণ করবেন, ১০ টি গুনাহ মোচন করবেন এবং তার জন্য ১০ টি স্তর উন্নীত করবেন।’’ [ইমাম নাসায়ি, আস-সুনান: ১২৯৭] [আস-সহিহ: ৯০৪]",
    "isChecked": false
  },
  {
    "title": "উপকারী জ্ঞান, পবিত্র রিযিক এবং কবুলযোগ্য আমলের দোয়া [৩ বার বলবে]",
    "description":
        "اَللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا (আল্লা-হুম্মা ইন্নি- আসআলুকা 'ইলমান নাফি‘আন ওয়া রিঝক্বন ত্বইয়্যিবান ওয়া ‘আমালান মুতাক্বব্বালান)\nহে আল্লাহ্‌! আমি আপনার নিকট উপকারী জ্ঞান, পবিত্র রিযিক এবং কবুলযোগ্য আমল প্রার্থনা করি।[ইবনে মাজাহঃ ৯২৫]",
    "isChecked": false
  },
  {
    "title": "বেশি বেশি দোয়া করুন!",
    "description":
        "সর্বোত্তম ইবাদত হল দোয়া।’[ মুসতাদরাক আল হাকিম ১৭৬০]\n ✓‘আল্লাহর কাছে দোয়ার চেয়ে বেশি মর্যাদাময় আর কোনো আমল নেই।’ [তিরমিজি ৩৩৭০] \n✓‘যে ব্যক্তি আল্লাহর কাছে কিছু চায় না, আল্লাহ তার ওপর রাগ হন।’ [তিরমিজি ৩২৯৫]\n✓ ‘সবচেয়ে হতভাগ্য মানুষ হল সে- যে দোয়া করতে অলসতা করে। [তাবারানি ৬০]",
    "isChecked": false
  },
];
